[{"make": "Suzuki", "model": "Carry", "car_model": "2020 Suzuki Carry Standard", "review_title": "nabeel butt", "reviewer_info": "Posted by Anonymous on Feb 19, 2020", "familiarity": "", "review_text": "Exterior is good up to some extent .. Interior is normal. Very good in fuel consumption . Handling etc in normal . Finally would like to say that those who looking for low fuel consumption then go for it                                                               .                                                                                                                                                                                                            .", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Carry", "car_model": "2018 Suzuki Carry Standard", "review_title": "Suzuki Carry Cars", "reviewer_info": "Posted by bareera on May 17, 2018", "familiarity": "Familiarity: I have neither owned nor driven this car.", "review_text": "The truck featured a pretty rudimentary build quality and judging by the way it looked it was a wonder that was able to last with dignity to relatively harsh working conditions. The Suzuki Carry, however, was like a small giant as its high ground clearance and the tough body gave it a surprisingly strong character that helped it to tackle almost anything was thrown at it. For its tiny dimensions, the Carry boasted a pretty large load area with a load deck measuring 1,620mm long, 1,340mm wide and 1,100mm height. The vehicle had also received a few design elements which make it look pretty cute such as the huge headlights, a wrap-round bumper, the sculpted bonnet and the huge windshield. The side panels of the van versions were mostly flat and were fitted with a large opening sliding door, while at the back there is a vertically opening tailgate.", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}]