[{"make": "Toyota", "model": "Mark II", "car_model": "2004 Toyota Mark II Grande 2.0", "review_title": "Mark II Grande 2004", "reviewer_info": "Posted by Syed Arsal Ahmed on Apr 23, 2023", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior: Even Though The Car Is Almost 20 Years Old It Doesn't Feel Outdated At All\r\nThe Seats Are Electronically Powered  And Are So Comfortable That You Won't Feel Tired Even After A Long Drive\r\nMy Favorite Part Is The Way It Looks So Majestic\r\nIn The Interior, There Is Nothing That Lacks In The Car\r\nYou Will Never Feel That You Are Sitting Inside A 20-Year-Old Car\r\n\r\nPerformance Is Top Notch It's Equipped With A 2.0Ltr  1G-FE Engine That Will Make You Feel That You Are Sitting Inside A Sports Car.\r\n0-100 Figures Are Also Good A Its Way Better Than A Civic Anyday", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Mark II", "car_model": "2004 Toyota Mark II Grande 2.0", "review_title": "Great buyer", "reviewer_info": "Posted by Umar Usama on Jun 28, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "look like luxury car electric seat one of the best car in Pakistan car market not comparison on Honda or grandi good fuel average 9 to 10 on city or 12 to 13 on long I recommend every one to buy under budget of 17 lac to 22 lac  parts are easily available and also cheap prize  and the size of car is so attractive mid size car", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Mark II", "car_model": "2003 Toyota Mark II Grande 2.0", "review_title": "Excellent value for money", "reviewer_info": "Posted by abdulrehman Chishti on Apr 18, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "The exterior of car is more or less similar with the 9th generation corolla because they both belongs to one family.The interior is very spacious and the seats are so comfortable just like sofa seats the boot space is also very good.let’s talk about the engine this car uses 1G beams 2.0 petrol engine which makes 160bhp and 198nm torque", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Mark II", "car_model": "2003 Toyota Mark II Grande 2.0", "review_title": "Toyota Mark 2 iR 2003 Review", "reviewer_info": "Posted by Anonymous on Nov 21, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "The body of  the car  is long which gives it a luxury look.The bonnet is long and the boot size is also suitable.The shape of  its doors is sleek and  attractive and the door handles are chromed.\r\nThe car has a beige interior and consists of inner wooden panels which give it an attractive look.There is a built in multimedia screen with  6 high quality speakers and navigation system.It has a single climate control.The performance of  AC is perfect and  the temperature can be changed manually.It is a spacious car which can be used by a family having 6 members.The boot space is also vast which makes the car suitable for long trips.It has an attractive analog meter.The drive is so comfortable that the driver can easily drive it for almost 6 constant hours.\r\nThe car consists of a 2000 CC efi  engine which easily gives you a fuel average of around  9 to 10 km per liter in city  and 12 to 13 on long routes. \r\nThe road grip and traction of the vehicle are above average.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Toyota", "model": "Mark II", "car_model": "Toyota Mark II", "review_title": "dream car. better than mercedes c180", "reviewer_info": "Posted by ali on Oct 26, 2009", "familiarity": "", "review_text": "the most important thing about this beauty machine is its low price comparatively altis or honda, this car meet my xpectations ina way tht this shows superb performance at cng. most luxurious car in low price, it seems to like a car above 40 lacs, i recommend it to every one,", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "3 rating", "overall_rating": 5, "helpful_votes": "(2 out of 2 people found this review helpful)"}]