[{"make": "Audi", "model": "A3", "car_model": "2015 Audi A3 1.8 TFSI", "review_title": "Performance Car", "reviewer_info": "Posted by Aurangzeb on May 27, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "Its a performance car; Fast , Powerful and Sturdy. Wanna leisure ride , a spin or daily commute it is always a pleasure.  Everything in it comes with certain detail and more than one option. Like there are  more than one option how to unlock the car and then how the locks will operate just to let you the car maker's mind is always at work. So any comparison  with Japanese or Korean cars in any aspect will be out of place as Audi is a different league. Being the most compact Audi it does not appear very flashy but it is unmistakably Audi. \r\n\r\nThe downsides are limited legroom in the back seat and fuel efficiency. Another factor is that it comes with Pirelli tires which are not exactly  for Pakistani roads but for big cities not an issue. Even though it has low road clearance but given shorter length won't be much of an issue. \r\n\r\nAdvice for its low profile tires recommended pressure is 33 PSI front and 38 PSI rare , slightly higher for winters. as standard 30 PSI won't work here.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Audi", "model": "A3", "car_model": "2018 Audi A3 1.2 TFSI", "review_title": "German tech for car lovers who want performance with style", "reviewer_info": "Posted by Rizwan yousaf on May 27, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "I owned A3 since last two years and it is my first German Sedan. Keep in mind for quality and speciality you have to pay some price. Great car in performance, style with attention. For new car there is no maintance for first two years as only oil change that too after 6 months. For performance it easily travel above 200 without any feel of high speed or stability. I am not talking about just touching but cont travelling on that speed.  Yes parts are expensive and replacement of parts like battery, tyres and other Maint above 40,000 km will be more but as I said earlier one have to pay extra for something different in your envmt. It is small entry level car like city or yasir, small family.  Keeping in view our Pakistan envmt it ideal to be used as 2nd or 3rd car. For use as  first car you have to keep in mind your envmt and parking space. Fuel eco is good. Ideal for driving on motorway, big cities and long routes.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Audi", "model": "A3", "car_model": "2017 Audi A3 1.2 TFSI Design Line", "review_title": "A best machine i have ever driven", "reviewer_info": "Posted by Abdul Wahab Siddiqui on May 21, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Ad mentioned in my subject. Its no doubt a best machine by the aspect of accleration, road grip, smoothnes, power &amp; comfortable drive.  i will share some pros &amp; cons for audi a3\npros\nAcceleration is amazing ( i found it better than grande &amp; even civic turbo)\nRoad grip is marvelous ( i didnt feel any type of hesitation while taking it to above 170 many times &amp; its not about taking o higher speed, it s about maintaining that speed, so even at 170 there was no sound &amp; car was quite smooth)\nFuel economy is quite efficient, body is quite strong &amp; interior is of superior quality\n\ncons\nyou need to use only TOTAL Hi-Octane fuel. not any other brand\nTires come with the size of 225 45r 17, which creates a lot of problems as it get flat whenevr you have passed through any bumps with speed. i replaced it with 50r.better for our roads.\n Rear seat is for two persons only, even they are also not so much comfortable with it.", "style": "5 rating", "comfort_rating": "3 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Audi", "model": "A3", "car_model": "2017 Audi A3 1.2 TFSI Design Line", "review_title": "Best car in town", "reviewer_info": "Posted by Farhan Siddiqi on Sep 28, 2017", "familiarity": "Familiarity: I owned this car.", "review_text": "I was have Altis grande for last 2 year and 3 month before I sold my grande  to change with new model, but instead wait for new model  I booked A3, I was worried about 1.2 TFSI engine as after shift from 1.8 to 1.2 TFSI, it was not looking good idea.  \r\n\r\nI got my A3 delivered in last week and my amaze for every thing performance, comfort, options, fuel economy and style every things is incredible.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Audi", "model": "A3", "car_model": "2017 Audi A3", "review_title": "Audi A3", "reviewer_info": "Posted by Zeeshan ch on Aug 17, 2017", "familiarity": "Familiarity: I owned this car.", "review_text": "Over all a good sedan,compact car but very good for a small family, specially the traffic on roads now days so Audi A3 is quite adjustable.fuel economy is really good,it does arround 16 to 20.1197cc but makes you feel like 2.0,turbo engine is really good,in 2 words I would say that if you wanna buy a turbo engine car then it's the best choice specially if u compare it with civic turbo then civic is on the ground and Audi A3 is the sky.almost same price then why to waste on civic when u have a much better option.worth buying", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Audi", "model": "A3", "car_model": "2015 Audi A3", "review_title": "audi a3", "reviewer_info": "Posted by ahmed raza shahid on Mar 01, 2015", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "An owsome car every thing is perfect. \r\n An perfect car but not made for Pakistan.\r\nAs this car is low\r\n As I have driven this car not made for karachi roads(just parked it)( my dad's client's car).\r\nthis car is hell fun to speed up as it 1.8 7 speed dual cluch transmission With paddle shifts. \r\nspending 4500000 adding on taxes this car is costs about 5 million rupees. only those people can buy it who are filth rich. \r\nIn my opinion I won't buy it I'm happy with my grande.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 3 people found this review helpful)"}]