[{"make": "Nissan", "model": "Dayz", "car_model": "2020 Nissan Dayz Highway Star G", "review_title": "Good Car", "reviewer_info": "Posted by Abubakr on Apr 22, 2024", "familiarity": "Familiarity: I owned this car.", "review_text": "Great overall car. Love all the features especially the 360 camera and adaptive cruise. However people mislead about its average. Its not fully hybrid and only gives 17 to 18 in city and about the same on the highway at 110. Ground clearance is a big issue as it has scrapped on speed breakers numerous times. Ride of the car is hard as you can feel every little bump and sound insulation is not good on the highway at high speeds.", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "3 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "Dayz", "car_model": "2018 Nissan Dayz Highway Star X", "review_title": "Good choice", "reviewer_info": "Posted by PWUser165834321959 on Jul 18, 2023", "familiarity": "Familiarity: I owned this car.", "review_text": "A very food option for 660 cc car. Great fuel average and comfort is good. It is a highway star in its category. Original alloy Wheels look sporty on the car and maximum space has been utilised from inside. Though the engine makes some noise when pushed hard on the accelerator. Otherwise not bad.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "Dayz", "car_model": "2013 Nissan Dayz", "review_title": "Good for Small Family", "reviewer_info": "Posted by Rana Mohammad Talha Tariq on Apr 10, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "Amazing car for a small family. Excellent fuel economy. Its turbo mode is quite responsive. AC is OKish as it tends to not work much perfectly in extreme summers. Small engine hence vibrations are there. In short, its good for a small family and economical because of amazing average. Spare parts are EXPENSIVE. Bad for those who likes to drive big cars.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "Dayz", "car_model": "2017 Nissan Dayz J", "review_title": "Value for money", "reviewer_info": "Posted by SHAHZAD YOUNAS on Feb 07, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "Brilliant fuel economical car. With an average of 20-24. Get its fuel tank full in RS2500. If you are looking to buy one you made a great choice! There are some problems also. The first is that sometimes it starts missing. The second is that the spare parts can not be founded easily plus they are very expensive. If you are buying this to drive within the city, its good but on the long drive its not good as the speed is low and on hilly areas such as way to Monal the car doesnt pick speed and you end up driving on 20km per hour.", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "3 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "Dayz", "car_model": "2016 Nissan Dayz S", "review_title": "2016 nissan dayz pros or cons", "reviewer_info": "Posted by Abdul Rehman  on Oct 18, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "I have nissan dayz simple 2016 model. Exterior outclass. Bht zabrdast sitting capacity hai pichli sitting bht zayada hai luxury feeling ati hi.fuel avg in city 15-16 not bad with ac without ac  long route\n21- 22 avg jo me ne nikali hi abi tk. \nsb se jo buri baat hai nissan dayz me iski pick ni achi overatake krte waqt bht tension hojati hai lekin gear k sth jo button hota use press krlo tu speed ka option ajata economy leaf chlee jate hai meter se or gari full power me ajati hi ?baki overall good car.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "Dayz", "car_model": "2015 Nissan Dayz", "review_title": "Nissan Days Roox", "reviewer_info": "Posted by Anonymous on Mar 19, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "I have this car for last more than two years, My range was maximum 11 lacs so in that range i had two options, either go for locally assembled Wagon R or some imported 660CC car. I didn't prefer Wagon R as spending(11.5 lac + 50k Own) wasn't really worth when its not giving you few basic features like ABS breaks, Auto Windows and last but not the least, Automatic Transmission. with this brief info, Following are the Car's features:\r\nExterior: Just an ordinary one like any other imported Japenese 660CC cars,  Gives somewhat a box like appearance to be precise.\r\nInterior: Is extraordinary, would beat any other car or same price range with the cabin space it has, comfortable seating, have climate control feature as well.\r\nRide Quality &amp; Handling:  Ride quality is average, Handling is not so ideal at high speed and feels like it's losing stability in heavy winds and highways on high speeds.\r\nFinal Words: Given these much I features in the given price, I think i made best decision.", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "Dayz", "car_model": "2014 Nissan Dayz J", "review_title": "Nissan Dayz 2014 model", "reviewer_info": "Posted by Ali Ahmed on May 19, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior: Out of all Japanese cars, i like this car's exterior design and Mira's the most. Most people will as well. It doesn't look like a carry dabba, it looks like a proper well build compact car.\r\n\r\n Interior: Fantasting interior with tons of space to put your stuff in. Front seats are like cushion and there is good amount of space in backseats. However, there is no space to put a spare tyre in.\r\n \r\nFuel Economy: Super good i would say. In winters it's 18-22 km/l whereas 14-17 km/l in Summers with A/C. \r\n\r\nRide Quality and Handling: Reversing this car is difficult if you don't have a back camera. Also i don't know but i find it much difficult to drive compared to my Honda City, probably because of the long dashboard. I don't know, it just feels floaty and doesn't feels like you are in full control of car as much as a City probably due to acceleration. It's performance is excellent for a 600CC car and never troubles me.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "2 rating", "overall_rating": 3, "helpful_votes": "(1 out of 1 person found this review helpful)"}]