[{"make": "Subaru", "model": "Stella", "car_model": "2014 Subaru Stella CUSTOM", "review_title": "Fantastic Car", "reviewer_info": "Posted by Hadi Hassan on Jun 11, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "Fantastic car too good drive excellent sofa seats good average a complete package in 17 lac original japanese brand suspension is good ac is also good i am in love with it its rebadged daihatsu originally owned by Toyota a car must have i ll highly recommend this machine", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Subaru", "model": "Stella", "car_model": "2014 Subaru Stella G Smart Assist", "review_title": "Alhumdolilah", "reviewer_info": "Posted by Nabeel Ahmed on Jun 10, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "Don't get fooled by people  buy the original japanese brand insteadof these local cheap chinese made alto etc. what u need in 16 lac when your car gives you 17-18 in city &amp; 20-22 with  ac on motorway / traction control / as / anti collision  &amp; ,much more &amp; if somenthing happens to your car go to bilal gunj buy a new assembly for 30 thousand &amp; you car good for another 5years.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Subaru", "model": "Stella", "car_model": "2014 Subaru Stella L Smart Assist", "review_title": "One of the best car", "reviewer_info": "Posted by Ahmed  on Jun 10, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "I'll say this is all market tactic or monoply to fail a car &amp; they only fail that car on which they have zero informantion .  This car is 100 percent more then the other Alto i had . what a proper intereior ./ exterior &amp; AC cooling is too good a best budget car in this price of 15.5 million. Same car if  i go with DAIHATSU will cost me 1650 minimum . here in pakistan the only thing matters is engine . body of all cars are almost showered but we are made fool by people in name of geniune . the only thing matters is engine . this car is too good to be true . Only one thing which I think should be improved is its head lights throw. rest is fine /", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Subaru", "model": "Stella", "car_model": "2014 Subaru Stella G", "review_title": "Better then any other Japanese in this price", "reviewer_info": "Posted by Ahmed  on Jun 07, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "Subaru no doubt is I believe the car we were really looking for over the years bought this car last month model 2014 full option in 1.6 million only one door touched rest was original this is the market lobby that they say this car market is v small only people who know that Subaru &amp; Daihatsu both owned by Toyota indirectly will buy this car rest  are just frogs of well know nothing about this car . This is full option car  with radar/ traction/ airbags/anti collison . abs &amp; if I buy same option car in move it will be atleast 17 lac so in one lac less I have same car. Will recommend people to buy this car  its a proper Japanese car .", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Subaru", "model": "Stella", "car_model": "2014 Subaru Stella CUSTOM", "review_title": "One of the best car better then move", "reviewer_info": "Posted by Mian Nabeel  on May 24, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "Alhumdolilah I have been using this car since 2017 imported it myself  . Previously I had daihatsu move  &amp; was afraid of buying stella but then researched &amp; found that Subaru is proper Japanese machine &amp; some of the cars are even produced by Daihatsu .  Subaru &amp; Daihatsu both are indirectly owned by Toyota so the build Quality is almost near to perfect one difference in Subaru is it's AC is far better then Move. . Will recommend this car if you are looking in a range 1.6 Million . Fuel average is far better on ac as well .", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Subaru", "model": "Stella", "car_model": "2015 Subaru Stella G Smart Assist", "review_title": "A complete Package", "reviewer_info": "Posted by Faizan Ali on Jul 14, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "Just imported Subaru Stella 2015, Its a complete package. Its actually Daihatsu Move rebadged as Subaru Stella. Car exterior is smart and stylish. Its  seems a bit boxy from front end but side views and  back of the car is beautiful. Interior is simple and elegant. Interior feels very spacious as compare to Mira and  Wagon R. Drive is an absolute noiseless and pleasurable.  Brakes performance is also very good. Fuel economy is the most exceptional things about this vehicle. I opted this JDM after checking out that it has the same engine as Mira but a better suspension and roomy interior.  In City car comfortably gives 25Km/l + without AC. \r\nI will recommend to buy this vehicle as a City smart car and go for G Smart  Assist Package to get extra features of Push Start, Alloy Wheels, Digital Climate Control, Smart Key and many more features..", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Subaru", "model": "Stella", "car_model": "2013 Subaru Stella L", "review_title": "Luxury small car", "reviewer_info": "Posted by Saeed Uz Zaman on Jun 24, 2016", "familiarity": "Familiarity: I owned this car.", "review_text": "I have been driving a Subaru Stella (or Daihatsu Move) for an year and so far its been a charm.\r\nThe compact 660cc car has a beautiful style and balance - headlights, hood, height, tyre size etc. all stand in harmony to give a decent stylish finish. The pearl paint gives it a shine that Suzuki can only dream of.  \r\nFrom the inside, among Japanese small cars, perhaps Nissan Dayz is more elegant, while local small car is far behind. It has amazing cabin space, rear seat drive is very comfortable, and all the modern auto features, locks, mirrors, windows, ABS, SRS airbags , traction control, radar, (beat that) are here. \r\nIn terms of performance, the acceleration is low between 0-40 , as its 660cc, once up, it is as smooth as Vitz in 80-90 km/h range. The suspension is beautiful, giving a comfortable ride. Economy meter is available, inside the city it gives 22 w/o AC and 19km/liter with AC on a light foot. \r\nPrice and parts are a bit expensive, but overall its luxury in economy.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(3 out of 5 people found this review helpful)"}]