[{"make": "Daihatsu", "model": "Terios", "car_model": "2012 Daihatsu Terios 4x2 Automatic", "review_title": "Great car value to money", "reviewer_info": "Posted by umer on Mar 18, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "This car is great and I bought this car in 2012 of 32 lack it is 4/2 automatic it is 1500cc which gives around 12 average in city the colour of this car is gray it has spare wheele whith it and rims are installed my purchase decision in that i want big car in which my family fits so its 7 seater so buy this carof 32 lack at that time i also have the offer of buying vigo champ but i opt this i also miss some thing in this car that multimedia screen sunroof cruise control etc it is japani car i was having budget in 2012 of 32 lack i buy this but now its not value to money as it did not sell many and its market does not maintain so i am getting very less amount of money of it which is 27 lack and this car has also ac at the back i change its filter oil after 5000 km and it cost 5000 although this car is very good", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "3 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Daihatsu", "model": "Terios", "car_model": "2013 Daihatsu Terios 4x4", "review_title": "Excellent Vehicle", "reviewer_info": "Posted by Kashif on Jun 30, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "It is no 7 years of flawless drive. As a farmer and solar installer used it offroad with no issues. Used it as business and family vehicle day in day out but Alhumdulillah no problems ever. Have mostly changed oil and filter and front brake pads. Fuel average still 12.5 km/l. Couldn't have made a better choice. Want to chang but performance forcing me to keep on using. Can't find a AWD with 7 seats and ecenomical fuel consumption. Disappointed with its new model with just rear wheel drive transmission and its high price. I will always remember my beautiful memories and experiences with this Terios. What performance with a tiny engine!", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Daihatsu", "model": "Terios", "car_model": "2010 Daihatsu Terios 4x2 Automatic", "review_title": "Excellent SUV", "reviewer_info": "Posted by khawar rafiq on Jul 12, 2014", "familiarity": "Familiarity: I owned this car.", "review_text": "One of the best vehicle I have ever driven for this money value. Very good pick, it is a mountain climbing tiger, on height when vehicles get very slow..it goes in lower gear automatic and runs very fast to go on top of the hill it leaves behind even Prados. very beautiful shape , many people get tricked if it is a Prado..so you get the luxury pride in less money. Fuel consumption is 10-12 Km/L in city/highway. It is seven seater,chilling Ac. it has a wide turning angle, it can turn around in a small space easily. I own this vehicle for last two year ...no complains so for.. very happy and satisfied with this purchase. I have no intention to sell and buy any other expensive one", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(3 out of 4 people found this review helpful)"}, {"make": "Daihatsu", "model": "Terios", "car_model": "Daihatsu Terios", "review_title": "WASTAGE of your money", "reviewer_info": "Posted by xuv1 on Jan 25, 2012", "familiarity": "", "review_text": "TERIOS! A piece of crap! Spending 30 Lacs for this chooza size so called jeep. it is better to buying Prado,Surf,Landcruiser or Nissan patrol. Who say that it is comfortable??? it is TOTAL LOSS FOR YOUR MONEY!!!..... Expensive parts &amp; not available easily, no comfort, not spacious.Daihatsu is total flop company around the world. APV is 1000 times better than this crap with better build quality &amp; availability of parts.Don''t buy this cheap quality &amp; ugly vehicle with BHENGI headlights shape is so ugly. NOT VALUE FOR MONEY IT IS RUBBISH SO CALLED SUV.", "style": "0 rating", "comfort_rating": "0 rating", "fuel_economy": "0 rating", "perfomance": "0 rating", "value_for_money": "0 rating", "overall_rating": 1, "helpful_votes": "(0 out of 3 people found this review helpful)"}, {"make": "Daihatsu", "model": "Terios", "car_model": "Daihatsu Terios 4x4", "review_title": "Fabulous car", "reviewer_info": "Posted by Tariq on Dec 13, 2011", "familiarity": "", "review_text": "Fabulous SUV. Excellent fuel consumption. Very comfortable. Reliable. Spacious.  Powerful. Very well equipped. Twin airbags.  ABS. Twin AC. Very good for both on road and off road driving.  It is a very good alternate 4WD vehicle and very affordable. A must own for Pakistani family.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(4 out of 9 people found this review helpful)"}, {"make": "Daihatsu", "model": "Terios", "car_model": "Daihatsu Terios 4x4", "review_title": "TERIOS A GOOD SUV BUT IT IS NOT A SUCCESS.", "reviewer_info": "Posted by hussnain1ali on Jun 12, 2011", "familiarity": "", "review_text": "TERIOS IS A NICE SUV BUT PAKISTANI,S ALWAYS GO FOR BUYING HEAVY CC,S  AND BIG JUNKS WHICH ARE NOT EVEN AFFORDABLE  IN FUEL ECONOMY BUT THIS BEAUTIFUL SMALL VECHILE DELIVERS EXCELLENT  FUEL ECONOMY AND IS NOW A DAY,S ALSO AVAILABLE IN AWD WHICH  I THINK MAKES IT A PERFECT OF ROADER MUST WRITE MORE REVIEW O N THIS .", "style": "3 rating", "comfort_rating": "2 rating", "fuel_economy": "2 rating", "perfomance": "4 rating", "value_for_money": "2 rating", "overall_rating": 2, "helpful_votes": "(4 out of 8 people found this review helpful)"}]