[{"make": "Toyota", "model": "Wish", "car_model": "2003 Toyota Wish 1.8X", "review_title": "Reliable 7 Seater in your budget", "reviewer_info": "Posted by Mudassar Latif on Aug 31, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "Toyota wish. 7 seater. 1800cc. Falls under 2.2 Million. Need I say more? The minivan is by far the most underrated machine in Pakistan. Neat ones fall under 2.2 Million and are a very good value for your money. Roomy and comfortable cabin space, sleek and decent exterior,  the well reputed 1zz-fe coupled with a sturdy and rugged 4 speed transmission; what more does one need for under 2.2 Million?  Spares are no issue and dealers and vendors have plenty of them. The vehicle averages around 9-10 km/l which is decent for a heavy 7 seater minivan. A very good buy indeed for those who know.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "5 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Wish", "car_model": "2003 Toyota Wish 1.8X", "review_title": "The most Underrated car", "reviewer_info": "Posted by Mudassar Latif on Jun 22, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "Starting  on with the exterior, the Toyota Wish has a very elegant and bold design and  also a touch of sportiness  as most of the  Wish models are loaded with Factory fitted body kits. When it comes to styling, I personally like the Wish more than any fielder, probox, or airwave etc. \r\nThe interior is far better than any of this car's competitor; Be it a fielder, isis, airwave, the Fit shuttle hybrid and even the Brv!  The car in topic-the X model-comes loaded with two front airbags-remember that  airbags were a new and big thing in the early 2000's. Standard options include Automatic Climate Control  and  it is a 7 seater by nature! :D\r\nThe car is powered by a 1ZZ-FE-the same motor in your popular Toyota Altis(1790cc)- so parts are the least to worry about.  Toyota's advertised power output is 140 bhp (142 PS; 104 kW) at 6,400 rpm and 127 lb?ft (172 N?m) of torque at 4,400 rpm. You see that power is not an issue here. It is more than sufficient for trips to Gilgit, Hunza.", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Toyota", "model": "Wish", "car_model": "2007 Toyota Wish 1.8 X Limited", "review_title": "perfect family car", "reviewer_info": "Posted by Usman Khan on Mar 31, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "exterior is stylish comfort is very good perfect family car very nice pickup fuel avrage is amazing trip tonic gare shifting 1800cc but fuel avrage of 14 to 15 in city and 18 to 20 on long roots handling is very good 7 seater 5 to 6 adults can easily travel on long roots it's value to money", "style": "3 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}]