[{"make": "Chevrolet", "model": "Joy", "car_model": "2005 Chevrolet Joy 1.0", "review_title": "Chevrolet Joy 2005", "reviewer_info": "Posted by Zohaib Hussain Chandio on Jul 19, 2024", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior\r\nThe Chevrolet Joy 2005 boasts a compact, aerodynamic design perfect for city driving. Its sleek front grille and integrated headlights offer a modern look, while its small size ensures easy maneuverability and parking.\r\n\r\nInterior\r\nThe cabin is comfortable and functional, featuring durable fabric seats and a user-friendly dashboard. Despite its compact dimensions, it provides adequate legroom and practical storage compartments for enhanced usability.\r\n\r\nFuel Economy\r\nThe Chevrolet Joy 2005 has been noted for its higher-than-expected fuel consumption. While designed for efficiency, its fuel economy may not meet all drivers' expectations, potentially leading to higher fuel costs.\r\n\r\nRide Quality\r\nRide quality is smooth and so much comfortable, with a suspension system that absorbs road imperfections well. The car's compact size and responsive handling make it easy to navigate through traffic, providing a quiet and enjoyable driving experience.", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "2007 Chevrolet Joy 1.0 CNG", "review_title": "Best Value for Money Car", "reviewer_info": "Posted by Khan on Jun 27, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior: It's a cute car it looks good better than many cars that are being sold in Pakistan\r\n\r\nInterior: Interior wise it is also good but as time passes it looks bit old\r\n\r\nBuild Quality: is awesome I mean really If you are comparing it with mehran or alto .. don't because it's superior in quality\r\n\r\nReliability: I'm 2nd owner since 2011 and haven't had any major issue with the car if car is taken care of it will take care for you. Be aware of mechanics they don't understand this car very well and they can destroy your car and you will then say that car is bad. One time I had a spark plug issue and mechanic was saying whole engine will be re built and etc then I went to another one who was already expert in this model of car and he instantly fixed the issue within 5 minutes so be aware of that.\r\n\r\nValue for Money: This is a really comfortable car compared to it's league giving fuel average of 11-13 with AC in city and 17-18 with AC on long. Parts are hard to find but available.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "2007 Chevrolet Joy 1.0 CNG", "review_title": "A Good Value For Money Car", "reviewer_info": "Posted by Khan on Aug 14, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior: Shape of the car is good much better than cars in this price range\r\n\r\nInterior: Interior wise it's okay not too comfortable for long journey for short it's more than good.\r\n\r\nEngine/Fuel Economy: 1.0 is not under powered but average if maintained well can easily beat Mehran but fuel economy is bad in city you get around 9-10 without ac and in long 11-12.\r\n\r\nParts: Hard to find parts and parts are expensive  but are cheaper then the most of the Japanese cars\r\n\r\nOverall this is good car for cities also you can travel on long routes if you maintain your car well it rarely even brakes I have this one from 2011 and till now I haven't had any big issue but make sure to find good mechanic otherwise local mechanics will ruin your car confirmed they don't understand this car very well. 110% Much better than Mehran/Coure/Alto/Cultus", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0 CNG", "review_title": "ignition coil", "reviewer_info": "Posted by wajiha77 on Aug 31, 2012", "familiarity": "", "review_text": "Ignition coil of chevy joy is damaged. New was installed by mechanic but it again damaged. Now car is standing in Peshawar. Kindly inform what can be problem &amp; how to resolve. Is there any expert available in Peshawar.Urgent response is required.thanks", "style": "5 rating", "comfort_rating": "1 rating", "fuel_economy": "1 rating", "perfomance": "0 rating", "value_for_money": "1 rating", "overall_rating": 2, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0 CNG", "review_title": "Where can We buy Chevrolet Joy 2012?", "reviewer_info": "Posted by Furqanbhatti on Aug 24, 2012", "familiarity": "", "review_text": "I love this car and in fact I am looking to buy the new model Joy 2012. Have they launched it yet? Where can people buy it?\r\n\r\nAll old dealers seems to have disappeared. Can somebody guide everybody in this regard, specially Rawalpindi/ Islamabad.\r\n\r\nI think everybody who likes this car and is looking for one will appreciate this information, me included.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0 CNG", "review_title": "Fuse box detail wanted", "reviewer_info": "Posted by Barkat Ali on Aug 20, 2012", "familiarity": "", "review_text": "Dear All\r\nI have Chevrolet joy white CNG 2007. Mechanic has stolen the fuse box cover , he has the same type of vehicle. Would any body send me the details of Fuses in internal fuse box. I have e-mailed to Nexus Automotive (Pvt) Ltd , chevrolet.pk@gmail.com but not got proper reply from Manager. Regards               \r\nbarkat50@yahoo.com", "style": "0 rating", "comfort_rating": "0 rating", "fuel_economy": "0 rating", "perfomance": "0 rating", "value_for_money": "0 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0 CNG", "review_title": "Fuse box detail wanted", "reviewer_info": "Posted by Barkat Ali on Aug 20, 2012", "familiarity": "", "review_text": "", "style": "0 rating", "comfort_rating": "0 rating", "fuel_economy": "0 rating", "perfomance": "0 rating", "value_for_money": "0 rating", "overall_rating": NaN, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0 CNG", "review_title": "CHEVROLET JOY", "reviewer_info": "Posted by AHSAN UDDIN SHAIKH on Jul 12, 2012", "familiarity": "", "review_text": "", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "5 rating", "overall_rating": NaN, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy", "review_title": "Excellent family car", "reviewer_info": "Posted by Yasir on May 09, 2012", "familiarity": "", "review_text": "Chevrolet Joy is a best family car with a very decent fuel consumption. It is best car of 1000CC family of cars in Pakistan in all aspects. Best for local as well as long drive. Parts are a bit expensive but it can be compromised on the performance of overall car.", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0", "review_title": "Nice Car", "reviewer_info": "Posted by syedszeeshan on Apr 26, 2012", "familiarity": "", "review_text": "When my cousin bought it, i thought it was a bad decision but later I found it good. For Karachi traffic, you need small car and this fits the requirement.\r\n\r\nThey are re-launching in June or July 2012.\r\nThe price is really attractive, I hope it will remain the same.", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "3 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy", "review_title": "Nice Car", "reviewer_info": "Posted by salman on Sep 30, 2011", "familiarity": "", "review_text": "A very nice and well priced car, though it is not available now. it is in fact Daewoo Matiz. \r\ni wish this car to be on roads like Mehran, infact in place of mehran.\r\nresale is not good therefore it has gone flop in Pakistan, another reason for its flop was stupidity of nexus who stop making thin car when spark was launched. \r\nBut it is very very good car.", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy", "review_title": "A car which is Destroy by Mechanics", "reviewer_info": "Posted by naeemaraze on Jul 10, 2011", "familiarity": "", "review_text": "It is a very nice car fully loaded. the worst thing about it is that the spear parts r not available in Pakistan as well, the Second point is that Its a totally Electronic machine but the mechanics are not understand this vehicle. they do \"octalpachu\" to destroy its image, I had a  6 months bad experience about this vehicle\r\n\r\nAlthough its a nice Car but due to these to main points I rated low.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "2 rating", "value_for_money": "3 rating", "overall_rating": 4, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy", "review_title": "Best car of its class but in hands of non-sincere providers", "reviewer_info": "Posted by Dr Zafar Iqbal PhD on May 11, 2011", "familiarity": "", "review_text": "I have Chev Joy 2009 black. It is still running very fine. Its can give you about 18-20 km/L on petrol on long routes and about same on CNG. Inside cities, it gives u about 11-14 km /L or Kg of CNG. I dont find any problem with CNG. Keeping in view the performance, comfort and advance features, this car is much much better than its competitors like Suzuki Cultus (I have also this car) etc. However, I think this car is in the hands of wrong importers and local providers. The main problem with this car is the in-competency of the proper mechanics and their dishonesty to put wrong spare parts. I discussed with importers/providers many times to rectify the problems but feel that probably they dont want to promote it. If these problems are rectified. Chev Joy can compete Toyota vitz in coming years as it has same power, strong body and good  shape but it is more comfortable and economical than even Toyota Vitz.\r\n\r\nI could not understand why Chev Joy or Spary promoters dont want to promote it more. Have they some indulgence from other companies which are Chevrolete competitors in Pakistan??????????", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(6 out of 6 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy", "review_title": "Better than Alto / Mehran / Santro /", "reviewer_info": "Posted by ali on Apr 18, 2011", "familiarity": "", "review_text": "A very good small car:\r\n\r\nPros:\r\n-Value for Money (Specially a used one).\r\n-Power Steering, Front and Rear Seat Belts, Power Front windows.\r\n-Fast.\r\n-Economical.\r\n-All parts available at good prices and of good quality.\r\n-Good build quality.\r\n\r\nCons:\r\n-Low Ground Clearance.\r\n-Very Small FF CNG Cylinder.\r\n-Very thin Paint job, car gets rusted just like any Suzuki.\r\n-Cable of Clutch lasts about 30 - 40,000 kms but is cheap to replace.", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0 CNG", "review_title": "Joy", "reviewer_info": "Posted by haters on Feb 21, 2011", "familiarity": "", "review_text": "A good comfortable car slightly overpriced. Maintenance  is a bit expensive. Good road grip and road clearance. power steering and power windows unlike suzuki cars in the same range. Not good resale value.\r\n\r\nCannot imagine why this car is not successful in Pakistan?", "style": "1 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "3 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0", "review_title": "Chevrolet Exclusive - The Best small car", "reviewer_info": "Posted by Yasir on Jan 28, 2011", "familiarity": "", "review_text": "I bought my chevrolet exclusive in 2005. Its the imported version with 800 cc engine.\r\n\r\nTo start with it is the best compact car around by a huge margin. Vitz comes in a different category and with a different price so cannot compare Vitz. Vitz is a better car than Chevrolet Joy or exclusive in my opinion.\r\n\r\nComing back to the car.\r\n\r\nIn last 5 years the only part that was replaced was reverse switch. Reverse light stopped working. Other than that the car is absolutely trouble free Mashallah.\r\n\r\nNever been to mechanic, no unusual sounds, no cheap quality material used. \r\n\r\nI love its fuel economy. It gives me between 18-21 km / liter on long routes and within city it gives an average of 13-14 km / liter. All this with ac and without extra effort to keep the fuel expense down by using a light foot etc. I don't have cng in it but I have seen trouble free exclusive / joy with cng. But who needs a cng when the avg is so damn good.\r\n\r\nIts a safe car as compared to its competitors. It has the usual seat belts, plus it has collapsable  steering wheel in case of impact with the steering during accident. The side doors have bars to give added protection in case of an impact. \r\nIt lacks ABS and airbags which is a disadvantage.\r\n\r\nFront seats are pretty comfortable and a person of my height 6ft can easily and freely move around inside the car. Even the passengers at the back are seated comfortably something which is missing in santro, mehran and even swift.\r\n\r\nThe car is not built for performance but for its 800cc engine its pretty fast and if driven within limits it has good road grip. The height of the car is not great which in turns hits speed breakers or car breakers in our case, but height is kept low intentionally to keep a good road grip. Overall I can say that it can easily beat any car in its category with performance on stock engine.\r\n\r\nIts a shame that the car couldn't make a place in the market and its discontinued now and a newer model is launched which is SPARK. Currently spark is imported and with high duties its not value for money in my humble opinion.\r\nYou can find a decent chevrolet joy in around 400k which is good value for money and overall I feel that its a car to keep. I believe my car can run trouble free for another 5 years or so.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(10 out of 11 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0 CNG", "review_title": "Chevrolet JOY a dream car for middle class", "reviewer_info": "Posted by ahrarian on Dec 13, 2010", "familiarity": "", "review_text": "Chevrolet JOY an appearing name in the market of today, It is so luxurious and comfortable as compare to all other cars of same category. According to market or re-sale point of view, It will gain more importance if people considere its features seriously and comparatively. Here in Pakistan, some trends were adopted in the past and still in vogue. We don't pay attention to new brands. Chevrolet has a well known International Company, If we value its brands, which are able to be valued and competitive with other companies, the Chevrolet company may launch its spare parts and other necessary equipments in market as well.  Then the grievance of expensive spare parts will be resolved and we can realy be enjoyed the most economical and comfortable vehicle within our pocket limits. Please encourage it a step ahead as Mehran VXR or other cars of such type.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "3 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0", "review_title": "one of the best cars", "reviewer_info": "Posted by umair  on Oct 24, 2010", "familiarity": "", "review_text": "This is the one of the best cars in Pakistan specially in small cars .. price is brilliant and comfort is great. one can prefer it on mehran, alto, cultus... the drawback of this car is that its spare parts are expensive and it does not perform well on cng.. otherwise it has the comfort like toyota", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "2 rating", "value_for_money": "3 rating", "overall_rating": 4, "helpful_votes": "(3 out of 3 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0 CNG", "review_title": "Chevrolet joy", "reviewer_info": "Posted by murtazakamal on Aug 10, 2010", "familiarity": "", "review_text": "My name is murtaza kamal..... and i love this car cause i have it you guys can see it on pakwheels.com ... i have uploaded the pictures of my car ... and well any ways . we are talking about CHEVROLET  like every one knows this company gives us the man can get whtever like small pack or a large pack you'll get every thing in it...... comfort , road grip , speed , style , and guys to be honest very few people know about this company cause they think CHEVROLET don't have a market well its true but WHY ? cause no body knows chevrolet  .. they good for market value not comfort thats a word they use nothing else i can bet this car is better then SUZUKI ALTO , MEHRAN , TOYOTA VITZ , or NISSAN MARCH or what ever ... so guys try this car and bring JOY to your life like i did ... im happy with JOY and JOY keeps me happy .... thanks", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy", "review_title": "NOT OWNER", "reviewer_info": "Posted by asad on Aug 16, 2009", "familiarity": "", "review_text": "I HAV'NT DRIVEN THIS CAR BUT I THINK THIS CAR HAVE WHAT WE WE NEED TO HAVE OUR OWN CAR AND THIS IS THE BEST CAR IN THIS CATEGORY AND PRICING.<br>\n<br>\nAND I THINK THIS CAR MEETS EVRY ONE REQUIREMENT OF BEING COMFORTABLE STYLISH POWERFULL IN HER CAPACITY ..<br>\n<br>\nIN CAMPARISION OF THIS CAR WITH OTHER CARS RELATED TO THE SAME CATEGORY AND POWER I THINK THIS CAR GOT EXCELENT REMARKS DUE TO THIS STYLE", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "3 rating", "overall_rating": 2, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Joy", "car_model": "Chevrolet Joy 1.0", "review_title": "A good car!", "reviewer_info": "Posted by SAVAK on Jun 09, 2009", "familiarity": "", "review_text": "Chevrolet Joy is a good balanced, roomy and a bit luxurious car when compared to Alto and coure. It has MPI engine that is better than both coure and alto engine. It has good suspension. It has power windows and power steering functions. Not found in coure and alto. The drive is pretty smooth.   <br>\n<br>\nHowever , there some negatives as well. Its not as popular as coure or Alto. It resale value is not good either. Maintenance is quite expensive compared to coure and alto. Maintenance points are also limited across the country.<br>\n<br>\nHowever , buying this car is worth the money spent.<br>\n <br>", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(6 out of 6 people found this review helpful)"}]