[{"make": "Daihatsu", "model": "Hijet", "car_model": "2016 Daihatsu Hijet Special", "review_title": "daihatsu hijet special varient review", "reviewer_info": "Posted by Syed Ali Akbar zaidi on Jul 03, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "My Daihatsu Hijet  2011 model 2016 import &amp; registered LAHORE Exterior wise very good looking interior simple but good looking sofa seats fabric ac chill not bad  Engine wise powerful fuel efficient alloys wheels installed by after market + safe guard ENTERTAINMENT SYSTEM AFTER MARKET INSTALLED WITH Original BACK VIEW CAMERA I OWNED THIS CAR FROM SINCE 2 YEARS I HAVE very satisfied with my car its maintain cost around 4500pkr: only wich  is very economical  original power steering abs breaks 4door power windows Abs breaks dual airbags i driven this car 45 to 50 thousand original retractable side mirrors with lights adjustable motors in beam tyres new suspension 100% engine 100% fuel average im city 14.5 with ac with out ac 18 on long 18 to 20 with ac  its carry 360 kg weight at the time  Its my family used vehicle &amp; second car for daily driven as a small car.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Daihatsu", "model": "Hijet", "car_model": "2013 Daihatsu Hijet Deluxe", "review_title": "OVERALL GOOD CAR IN PRICE", "reviewer_info": "Posted by Mohammad Shariq on Jun 09, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "Very good car in the price look wise bhi bohut achi hai or interior bhi bohut acha hai every kai mukable mai. Ride comfortable hai or suspension bhi soft or smooth hai. Gari ki average bus ok kaho ga 12 ki average daiti hai city par bus iski maintainance time to time kare koi issue nahi hoga gari mai. Gari ki pick halki si low hai likin ap 8 person ko bhita kar chalou gai tou gari load nahi laigi gari speed nahi pakarti likin power bohut hai 660 cc engine kai lihaz sai", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Daihatsu", "model": "Hijet", "car_model": "2009 Daihatsu Hijet Deluxe", "review_title": "Daihatsu Hijet 2009", "reviewer_info": "Posted by husain on Jul 17, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Very good van. Suitable for pick and drop and rental services. 4 wheel drive. Extra seats (8 seater). Two leds. One fan for back seat passengers. Ac is in very good condition. Manual transmition. Good for hilli areas. Good for transportation services.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Daihatsu", "model": "Hijet", "car_model": "2008 Daihatsu Hijet", "review_title": "bad car for family", "reviewer_info": "Posted by ajmal shafiq on Jul 27, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "fuel average is very bad engine seals every winter season har sal engine ka head tyar karwana par ta hai baki hijet thek hai load mehsoos nahi karti bas tapad means valves har sardi mai taite ho jatai hain valves adjustable bhi nahi hain head assemble bhi sahi nahi milti mechanic engine head tyar karnai     sai in kar karta hai", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "1 rating", "perfomance": "2 rating", "value_for_money": "1 rating", "overall_rating": 2, "helpful_votes": "(0 out of 0 people found this review helpful)"}]