[{"make": "Nissan", "model": "AD Van", "car_model": "2007 Nissan AD Van 1.3 DX", "review_title": "Excellent Value for money", "reviewer_info": "Posted by Arif on Nov 17, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "I have this car for 5 yeafts Exterior is good and simple if you want to touch up work it will be easy with this type of body. Having very strong body even bumpers are also to strong. Interior is also good. Ac and heater is so good. Passenger space is less with leg room but acceptable But too much space in back you can fold passenger seat and find too big space in back even there can 3 adults sleep easily. I have done country tours 3 times with my family runs very good with good road grip fuel average is Ok but not too good it gives 12-13 on highways and 8-10 in city. All parts available but sometime it takes time to find in other cities. Finally in my opinion  there is no car in Pakistan at this price with lot of utilities", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "AD Van", "car_model": "2006 Nissan AD Van 1.3 DX", "review_title": "Nissan AD 2006", "reviewer_info": "Posted by Anonymous on Jun 15, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior wise car is good and interior is also compared to other cars is good. in small budget good car for those who has a lot of laguage problems as Nissan AD van has a lot of  trunk space. AC chilled, maintainanc wise every thing is available but little bit costly as the spare part imported from Japan and as per Dollar fluctuation spared also get high or low . fuel average is not good, the leg space for the passenger seat is not good anyhow justified. overall car is good. I purchased it in before one year but facing a engine missing problem and in Islamabad no one good mechanic found till date for solution of the problem. I think all the Nissan lovers have to make a plate form for general discussion of whatsapp  regarding maintainance and other problems facing by nissan owners\r\n\r\nany how car is good", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Nissan", "model": "AD Van", "car_model": "2006 Nissan AD Van 1.3 DX", "review_title": "Nissan AD 2006", "reviewer_info": "Posted by Anonymous on May 12, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "exterior is almost good, fuel average is not too good as compare with other cars of this generation, however, in the small budget you can get a good car, but whenever you want to purchased this car it may also be in your mind that the resale of this car is not too good and it will take time to resale.Nissan is the brand but unfortunately it can not maintain its business and its name in Pakistan and mostly people of Pakistan are not aware with the brand of Nissan and everyone in Pakistan preferred to take Toyota Corolla which is a popular all over in Pakistan. \r\n\r\npresently i am facing engine missing problems in may nissan if any one has experience in this regard may please be shared with me on abdulwajidrafique@gmail.com", "style": "2 rating", "comfort_rating": "2 rating", "fuel_economy": "2 rating", "perfomance": "4 rating", "value_for_money": "1 rating", "overall_rating": 2, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "AD Van", "car_model": "2006 Nissan AD Van 1.3 DX", "review_title": "Nissan AD", "reviewer_info": "Posted by Alaas on Jul 01, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": NaN, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "AD Van", "car_model": "2006 Nissan AD Van 1.3 DX", "review_title": "Personal Experience", "reviewer_info": "Posted by Abb on Jan 05, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Value for money as compared to local cheap cars. Only drawback is rear leg space and resale issue. Good family car having huge capacity in trunk. Mileage 15 Km on long and 10 Km in city. Wonderful front space, chilled AC etc. If you are interested to keep the car for a longer duration, it is recommended.", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(3 out of 3 people found this review helpful)"}, {"make": "Nissan", "model": "AD Van", "car_model": "2006 Nissan AD Van", "review_title": "Best in the price tag", "reviewer_info": "Posted by Anonymous on Apr 23, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior wise, the car is not that attractive as from front it gives looks similar to Corolla /  Nissan Sunny of 80s and tail lights are also not that attractive. Mostly only white color is available which means more grace than styles.\r\n\r\nInterior wise, also a bit on a lower side as its interior is not that attractive with all the knobs of old fashion and only driver window is powered, side mirrors are manual but has adjustable steering  &amp; headlights. The previous seat has a very limited leg space but has a huge trunk space.\r\n\r\nFuel economy is lower as compared to modern cars with latest technologies. It gives around 12 with AC on long and around 10 local. Consider its price tag and  comfort its actually acceptable.\r\n\r\nPerfect family car, perfect performance and exceptional ride quality. Perfect value for money also but parts are difficult to find considering very less cars in Pakistan.", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Nissan", "model": "AD Van", "car_model": "2007 Nissan AD Van", "review_title": "Excellent car", "reviewer_info": "Posted by mannankhanz on Nov 03, 2015", "familiarity": "Familiarity: I owned this car.", "review_text": "Very good car its road grip its brakes fuel consumption every thing is excellent.                                                                                                  Its value of money.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 1 person found this review helpful)"}, {"make": "Nissan", "model": "AD Van", "car_model": "2007 Nissan AD Van 1.3 DX", "review_title": "Nissan AD", "reviewer_info": "Posted by Wasi Hasan on Oct 28, 2015", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "Basically I'm a car review writer. I analyse car and it's specifications and then present them for u. Beginning from the exterior , ad is good family wagon. Its with black bumpers and rear wash wiper. A smooth and aerodynamic shape. Considering the interior, Interior is not very attractive due to its knobs. The interior is full of old school designed knobs. As per features, it has only front power windows and rear windows are manual. Rear legroom is so small. Difficult for legs to relax. Although it's automatic the engine is very smooth and no knocking. If u want luxuries u can go for fielder. But if u want more luxuries it's the same example the more sugar more sweeter .It's a good car for Pakistan. The price range is 8-9 lacs", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(2 out of 3 people found this review helpful)"}]