[{"make": "Suzuki", "model": "APV", "car_model": "2013 Suzuki APV GLX", "review_title": "Suzuki company na ish gari ki price bohat zada rakhi howi ha", "reviewer_info": "Posted by Asim fazal on Jan 08, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "gari dekhne ma decent look ha fuel average boht achi ha comfort level acha ha family use ka liye zbardast ha tour per jane ka liye bahtreen ha price boht high ha iski price 3 sa 3.5 million ka ander honi chaye\nincity milaege 14.15\nhighway 17\nengine power zbrdst ha", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "APV", "car_model": "2017 Suzuki APV GLX", "review_title": "Apv lover u will not find a apv like this", "reviewer_info": "Posted by Mazher Qureshi on Dec 07, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "I wana sale my apv just like brand new 2017... I love this van the powerful engine the dual ac I love it..white colour 23k driven seeing is believing... Van is total genuine not a nut have been changed ever a piece for apv lover... For big family there is no such thing as apv", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "APV", "car_model": "2019 Suzuki APV", "review_title": "AB AWAN", "reviewer_info": "Posted by Anonymous on Apr 01, 2019", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "I drive this car overall not good car  due to very high price, no basic option like airbag/auto gear eI drive this car overall not good car  due to very high price, no basic option like airbag/auto gear etc.  waste of money  tc.  waste of moneI drive this car overall not good car  due to very high price, no basic option like airbag/auto gear etc.  waste of money  y  I drive this car overall not good car  due to very high price, no basic option like airbag/auto gear etc.  waste of money", "style": "2 rating", "comfort_rating": "2 rating", "fuel_economy": "2 rating", "perfomance": "3 rating", "value_for_money": "2 rating", "overall_rating": 2, "helpful_votes": "(0 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "APV", "car_model": "2014 Suzuki APV GLX", "review_title": "one of the best i had so far", "reviewer_info": "Posted by mohammad saeed on Apr 03, 2014", "familiarity": "Familiarity: I owned this car.", "review_text": "my name is saeed in usa for the last 20 years there is no car or make i have not driven i bought apv in dec 05 from Rawalpindi pakistan as of to day i still have it use it when ever we visit pakistan  i love it one of the best car i used so far have honda piolt here in usa 2011 but belive me i love suzuki apv more then honda", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(4 out of 5 people found this review helpful)"}, {"make": "Suzuki", "model": "APV", "car_model": "2012 Suzuki APV GLX", "review_title": "A Fantastic Van for large family, Specially CNG model", "reviewer_info": "Posted by Aamir Umar on Apr 07, 2013", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior: Excellent. Looks good. Fantastic for parking in narrow spaces.\r\nInterior (Features, Space &amp; Comfort): Excellent interior with lots of space inside for 8 persons. Though for extra luggage you need an over head carrier.\r\nFuel Economy: Factory fitted CNG does 110 kms in the cylinder. Otherwise it does 10 km/lit. Both mileages with AC in Lahore.\r\nRide Quality &amp; Handling: For a van, the ride quality is excellent. Specially on Pakistani roads the suspension is too good. \r\nFinal Words: An excellent van for a family of 6-8 persons.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(4 out of 10 people found this review helpful)"}, {"make": "Suzuki", "model": "APV", "car_model": "Suzuki APV GLX (CNG)", "review_title": "Why expensive", "reviewer_info": "Posted by umair504 on Feb 22, 2012", "familiarity": "", "review_text": "I have been using apv many years ago.A perfect car for family use,but why it is very over priced this is first car or van of suzuki which is very expensive good style and good engine.A good luxury 7 seater car.I have very good experience with this car", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Suzuki", "model": "APV", "car_model": "Suzuki APV GLX (CNG)", "review_title": "A Family Car", "reviewer_info": "Posted by Umar Ali on Dec 19, 2011", "familiarity": "", "review_text": "I've been driving/travelling in an APV for almost 4 years now. (in fact i learned driving using this vehicle! ) \r\n\r\nFirstly lets get to the basics, the Price. Currently its a bit overpriced. Though i would still go for it as a family 7-seater over any jeep/vehicle in this price range. \r\n\r\nComfort: To be honest for an imported vehicle its not the most comfortable car. Though i have seen worse, much better than many Pakistani cars/vans. (and it has LOTS of SPACE! ) that's all that matters, i guess.. \r\n\r\nConsumption: On CNG its fairly cheap. Specially on long drives. On petrol its a bit expensive cause of the extra power due to the weight. But i'd prefer driving it on petrol all the time as its totally at a different comfort level on petrol! (though i don't pay for either, so i guess my opinion doesn't matter. My dad pays and he says its good on CNG :P ) \r\n\r\nNow to the other things that matter, \r\n\r\nPower: it has lots of power! the 1.5L engine is just about the right size for this vehicle. \r\n\r\nSafety: Here is where the APV looses most of its points. It has NO ABS! That really is the worst part. NO AIRBAGS! The tires, play an important role in keeping the car stable. if you change them to bigger ones, you might increase the comfort but decrease the stability! its fairly stable, as a teenager like me hasn't killed himself yet, using the vehicle. So its stable till that extent. Though after a few years it will be very risky to drive it over 120 km/h on the Motorway or anywhere for that matter, as it wobbles, and feels very unsafe. \r\n\r\nPracticality: It is the best car in this section. It has LOTS of space for ANY type of luggage.. Though the CNG cylinder does take a bit of space in the back, there is still room to put two big bags behind the rear seats. You can easily fit 10 people in it. Though the people at the back will be a bit squeezed. Add one of those roofs to it and your luggage problem for these ten people is solved. (if each person has a bag ) \r\n\r\nOverall, it is one of the best Cars/Vans i've seen in Pakistan. And in this price range any other vehicle of it's type can not compete with it. \r\n\r\nThough if you can manage the cost of fuel, i'd suggest getting a Prado or Pajero.. As they are more fun to drive and has way more power plus comfort. Only problem would be they'd be old and the APV would be brand new.", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 3, "helpful_votes": "(3 out of 3 people found this review helpful)"}, {"make": "Suzuki", "model": "APV", "car_model": "Suzuki APV GLX (CNG)", "review_title": "Why expensive", "reviewer_info": "Posted by Muhammad Ali murad on Jun 27, 2011", "familiarity": "", "review_text": "its is expensive due to pak suzuki import it.it is not pak made like others.all pak suzuki cars donot have quality but apv and jimmny are quality cars.its air conditioner(AC) is amazing not like suzuki daba\r\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 4 people found this review helpful)"}, {"make": "Suzuki", "model": "APV", "car_model": "Suzuki APV GLX (CNG)", "review_title": "Suzuki Apv", "reviewer_info": "Posted by Adeels1 on Apr 13, 2011", "familiarity": "", "review_text": "Suzuki Apv is a nice driven van but price is to much as compere to local marcket, i donot know that why Suzuki makes pak people foolish.\r\nI donont comment on its performance........................................................................................................................................................................................................................................................................................................", "style": "1 rating", "comfort_rating": "0 rating", "fuel_economy": "0 rating", "perfomance": "0 rating", "value_for_money": "0 rating", "overall_rating": 2, "helpful_votes": "(2 out of 4 people found this review helpful)"}]