[{"make": "Mercedes Benz", "model": "GLS Class", "car_model": "2018 Mercedes Benz GLS Class GLS450", "review_title": "Mercedes GLE 400 4 matic", "reviewer_info": "Posted by Choudhry Abdullah  on Nov 08, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "Mercedes-Benz introduced the GLE-Class in 2016, and the 2017 Mercedes-Benz GLE-Class is carried over virtually unchanged. Although the name is relatively new, the vehicle itself is familiar. The GLE-Class is essentially the old M-Class, Mercedes' familiar and popular midsize luxury SUV. Pleasingly, though, Mercedes took care to do more than simply give this SUV a cosmetic face-lift; it also improved the GLE cabin and added new features. The company also added a GLE-Class Coupe model", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Mercedes Benz", "model": "GLS Class", "car_model": "2020 Mercedes Benz GLS Class", "review_title": "mercedes gls", "reviewer_info": "Posted by Anonymous on Sep 02, 2020", "familiarity": "Familiarity: I have neither owned nor driven this car.", "review_text": "exterior  of this  car is  elegant . but the signature front grill  is some what controversial.  this is third generation of mercedes  gls class\r\nthis is considered a competitor of BMW X7. the multi beam LED headlamp system with total 112 LED bulbs per head lamp are fitted along with DRLs\r\n\r\n also this  car has  many engine options e.g  3.0 and 4.0 litres and v8 engines . \r\nthis  car does not have split tail gate.the car has a  9 speed  automatic \r\n9G tronic gaear box. \r\ncompany calims it to be an S class of  SUVs. \r\noverall, in my opinion the BMW X7 is better than this mercedes GLS", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(0 out of 1 person found this review helpful)"}]