[{"make": "Chevrolet", "model": "Optra", "car_model": "2009 Chevrolet Optra 1.6 Automatic", "review_title": "Optra review", "reviewer_info": "Posted by Abdelali DEKHILI on Oct 12, 2024", "familiarity": "Familiarity: I owned this car.", "review_text": "Recently I bought Chevrolet optra 2009 1.6 fuel, I am satisfied with this car just the fuel consommation was a little high , but I installed the LPG system, the LPG price is backgrounded in Algeria 500 KLM ---02 €\n...I am enjoying my time with optra ??", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Optra", "car_model": "2005 Chevrolet Optra 1.6 Automatic", "review_title": "Excellent Value For Money", "reviewer_info": "Posted by PWUssss on Jul 01, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "I bought this car three times because whenever i buy another car i just miss it.\nThis car has amazing build quality it looks and feels so upscale compared to japanese Pakistani cars like corolla city and civic. It has many features that even new grande and civic doesn't even have keep in mind grande cost 55 lacs. Optra has Cool box, Glovebox Lights, automatic trunk release, Wiper Speed dial adjuster, lumbar support, 5 way adjustable seats and headrest can be adjusted 5 levels. And drive is very excellent i am getting 11 12 km/L local fuel average and on long it gives 17+ which is very good and better\ni recommend you to buy this car it only cost 13 to 15 lacs which is mehran money", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Optra", "car_model": "2006 Chevrolet Optra 1.6 Automatic", "review_title": "Good sedan in this price range", "reviewer_info": "Posted by Faizan Mubasher on Oct 15, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior:\r\nIf I see look back in 2002-2008, then it's look great and competing with Pakistani market GLI and Civic.  Even in 2020 when I own this car I am still very much happy with its exterior look.\r\n\r\nInterior:\r\nI have driven Honda City 2009 and Baleno but I found its interior far more superior than these two and it is still intact (No crack, no issue). It gives luxury feelings.\r\n\r\nEngine:\r\n1.6 - The last owner of the car didn't take much care of the car so I went to engine overhaul. Now I am driving in running period as directed by mechanic not take it more than 2000 rpm. And even in running, its response is great. \r\n\r\nFuel Average:\r\nNow  this is the area which most Pakistanis think a lot. I would say that it is average fuel economy car as compared to GLI and other 1.6-Litre cars. I got 10KM in long route (Engine is still in running condition) but in city it is far less. May be 8KM and that too without AC.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Optra", "car_model": "2010 Chevrolet Optra 1.8 Automatic", "review_title": "A luxurious car at an affordable rate", "reviewer_info": "Posted by Osman on Dec 28, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "After having a very good experience with Chevrolet Exclusive and Optra I finally got Chevrolet cruze but its engine was all messed up with modifications by local mechanics. I got its engine overhauled from M/S Suntech and imported parts directly from GM Motors Korea. The car is excellent in terms of build quality, drive and advance options. gives 8 to 9 kms per litre in city and 15 plus on long route.\r\nCruze is the biggest of all compact and has the quietest interior .Cruze is the first true GLOBAL effort from General Motors around the world. Cruze is a cruze in North America, Australia, Europe, Asia, South America and so on.(61 countries all together). Its really a dream car.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Chevrolet", "model": "Optra", "car_model": "2005 Chevrolet Optra 1.6 Automatic", "review_title": "best budget car", "reviewer_info": "Posted by junaid choudhary on Oct 29, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "looks sporty and luxury as a big sedan like corolla and civic \r\ninterior is also luxury with climate control,airbag,power steering,comfortable seats etc\r\nfuel economy is not so good as corolla can be compared with honda civic reborn\r\nexcept bad fuel average i guess its a value for money and luxury car in this price \"market vaalue is also not so good\"", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Optra", "car_model": "Chevrolet Optra 1.6 Automatic", "review_title": "A treat to drive--Optra", "reviewer_info": "Posted by alisiddiq on Feb 05, 2011", "familiarity": "", "review_text": "A year ago, when i left my bank job, i had to retrun the bank provided corolla (GLi 2008 model) back to the bank. At that time i was not much aware about the prices of used car but i was shocked to learn that a used 1000cc car like cultus and vitz is selling at a price range of 700k to 1100k. While all the bigger cars were kind of out of my budget and affordibility. Still I wanted a bigger car and classy car and optra 2005 got all one expects in a car of class. It comes with full option that even reborn or all new corolla failed to offer till now and that too at a price of a cultus. I have been a proud owner of the car now for more than a year and love to drive the car, especially on motorway where the beast like engine of the car gets a chance to flex its muscles. The airconditioning is supberb and the climate control keeps the inside of the car comfortable, while the cool box keeps the water, drinks and chocolates cool during the long journeys. The driving seat has the legs and lumber support keeping the long drives pleasureable and tireless. The spares of the car are easily available in Lahore from Montgomery Road and Chevy Platinum Motors at a very reasonable price (parts are cheaper than vitz and new swift). A good well maintained used optra is available at a price range of 850K to 950k, which according to me is the best value for money. The only problem with the car is that there are no service centers or spare parts availability in smaller cities. I strongly recommend the car to people who want to drive bigger car at a price of a cultus.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(6 out of 6 people found this review helpful)"}, {"make": "Chevrolet", "model": "Optra", "car_model": "Chevrolet Optra", "review_title": "Optra-A Value for Money car", "reviewer_info": "Posted by Muhammad Kamran on Jan 19, 2011", "familiarity": "", "review_text": "I have recently sold my Chevrolet Optra 1.6 automatic. I would'nt have sold this car if it would have been good at fuel average, Its a good car since you cant get this kind of luxurious car in this price range. The comfort level is excellent. Mind it.. my 2 last vehicles were SSANGYONG Rexton and Honda Accord CL7. So you can compare what comfort I am talking about...&gt;&gt;\r\n\r\nSo my final comment would be if you can get CNG installed on this car which ofcourse SEQUENTIAL CNG unit only, then its the best value for money.", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "1 rating", "overall_rating": 3, "helpful_votes": "(6 out of 7 people found this review helpful)"}, {"make": "Chevrolet", "model": "Optra", "car_model": "Chevrolet Optra LS", "review_title": "General Review", "reviewer_info": "Posted by haters on Sep 28, 2010", "familiarity": "", "review_text": "The ride is awsome. look is very nice. Comfort and luxury is smoothly balanced.But the price is quite high.In hatchback it is however a good addition. Parts are available but fairly expensive. The tires are of good quality.\r\nCar is available in good colors and its has a nice exterior look unlike joy. But again the cost to buy is quite high.", "style": "0 rating", "comfort_rating": "0 rating", "fuel_economy": "0 rating", "perfomance": "0 rating", "value_for_money": "0 rating", "overall_rating": 0, "helpful_votes": "(0 out of 1 person found this review helpful)"}, {"make": "Chevrolet", "model": "Optra", "car_model": "Chevrolet Optra LS", "review_title": "Good thing about Spark", "reviewer_info": "Posted by Hasan Karim on Sep 20, 2010", "familiarity": "", "review_text": "I have read the comment which was posted by ayaz I am fully admit that spark is the only car which gives you satisfaction in term of fuel, running and comfort. In 800cc I have never seen in my life such a wonderful car. I enjoyed a lot with my Chevrolet Spark.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 1 person found this review helpful)"}]