[{"make": "Mitsubishi", "model": "Lancer", "car_model": "2004 Mitsubishi Lancer GLX Automatic 1.3", "review_title": "Abdullah pervaiz", "reviewer_info": "Posted by Local Sourcing on Mar 29, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "it style is more royal and vintage than new competitors it is low in performance but after 60khm it give an impressive results it is full comfortable for 5 person and 4 child were also sit at it back seat ac performance is fabulous and on long route it easily go on 160 km  with 5 passengers with ac on the rpm of 4000 or 4500 its spare part is not available easily but definitely its ride is more comfortable than new 2019 altis or grande back seats like a sofa a good power steering very rear car in pakistan it has a good trunk space like 2 big bag and 1 small bag can  easily carry and bulit quality is fine than new one and also at that time cars like civic and corolla interior is desing in a good way and engine bay is huge can easily swap another engine road grip is very good according to car model and braking is good  it is a unique machine on road and if you want to buy so it is a good option and value to money and a good family car ????  you may enjoy it ride", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Mitsubishi", "model": "Lancer", "car_model": "2006 Mitsubishi Lancer GLX 1.5", "review_title": "Lancer is above all local brands", "reviewer_info": "Posted by waqas ali on Dec 28, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "Its looks are awesome, decent and delegate. The lights are beautifully shaped and designed.\n\nThe interior has all option which other competitors of all cars have. Blower of AC is strong and AC works pretty good. Seats are very comfortable and cabin is very spacious. Steering handling is also very good, the most good thing about is its suspension, it is really soft .\n\nI have the japanese model, its gear shifting is very smooth and acceleration is remarkable.\n\nIn a budget between 11 to 14 lac its good option, much much better than corolla and honda.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Mitsubishi", "model": "Lancer", "car_model": "2005 Mitsubishi Lancer GLX 1.3", "review_title": "A good machine of its age", "reviewer_info": "Posted by Anonymous on Oct 24, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "i got lancer about 1.5 years ago. indeed  driving and comfort level is way better than toyota and honda . more spacious indisde and road grip is just awesome . engine torque is less than city and  Toyota . overall fuel avg is 14-15 km  on long  and  10- 11 in city . \r\ngood car in low price overall . \r\ndriving experience is very very relaxing .", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "2 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Mitsubishi", "model": "Lancer", "car_model": "2006 Mitsubishi Lancer", "review_title": "Lancer JDM variant", "reviewer_info": "Posted by Sahbaan Rehman on Dec 12, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "The exterior of Mitsubishi Lancer is preety much the same as it was in 2004. But the main differences are of headlights and front grill and bumper.\r\nThe interior is very stylish and is of good quality as it is an imported car. The interior is in blackish grey colour and the car is automatic with 5 speed CVT transmission. the drive of Lancer is very pleasant and there is no lag in CVT gearbox. The shifting of the car is very smooth. I impoted and bought the car in 2012. The car is a 1.5 litre engine. It is a very powerful car with 0 to 100 in 11 seconds.The car is best for 5 adults.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Mitsubishi", "model": "Lancer", "car_model": "1985 Mitsubishi Lancer", "review_title": "Great Car to have Lancer 1984", "reviewer_info": "Posted by Prof Wajid on Sep 21, 2016", "familiarity": "Familiarity: I owned this car.", "review_text": "Newly painted and just like new car.... Interior was full geniun and very smooth running while driving... Comfortable and big space for sitting... Engine is water dropping.... Sold because my area don't have enough room for the big size car.... Overall I am very satisfied with the performance and comfort of this car.... Spare parts can be found from Plaza Market, Shafiq Morr and Shershah Market easily.... Resale is strangely towards lower side in Pakistan.... Better then Suzuki and Honda...... Recommended for long routs and family use...  Thanks", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "1 rating", "overall_rating": 3, "helpful_votes": "(0 out of 1 person found this review helpful)"}, {"make": "Mitsubishi", "model": "Lancer", "car_model": "2005 Mitsubishi Lancer GLX SR Automatic 1.6", "review_title": "Review", "reviewer_info": "Posted by Taimur Ahmed on Jun 02, 2016", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior: Solid build quality. Even after 11 years, car's underside is rust free. Wheel alignment still perfect even after travelling all over Pakistan.\r\n\r\nInterior: Good materials used from interior. Spacious and does not get as hot under direct sun as locally manufactured cars.\r\n\r\nRide &amp; Performance: Excellent road grip. Automatic CVT transmission has very good performance in economy mode, sport mode and in mountainous terrain.\r\n\r\nSpare Parts: Not all parts are available due to the winding up of business by Dewan Motors but those can mostly be purchased online and brought as personal baggage through a friend, relative, etc. coming from abroad. Using genuine parts ensures that your car is prim and proper, and gives you a long hassle free life.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(2 out of 4 people found this review helpful)"}]