[{"make": "GUGO", "model": "GIGI", "car_model": "2023 GUGO GIGI", "review_title": "Expansive and Less milage", "reviewer_info": "Posted by kineya gul on Sep 10, 2024", "familiarity": "", "review_text": "Design wise excellent, features are good too, comfort level is also good, but expensive. it should be somewhere in rang of 2.00 million to 2.500 million. rang is also not too good, with this price the rang should be at least 350 KM plus. price shall be such that it is affordable by most of middle class.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "2 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "GUGO", "model": "GIGI", "car_model": "2024 GUGO GIGI 220", "review_title": "exterior must be changed", "reviewer_info": "Posted by PWUser169701236987 on May 18, 2024", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "it excellent small car for pakistan. i tested its drive and pick is excellent when compared with small cars. But it is too small size and its shap e is not give  modern look rather ugly.\r\nif company improve its shape like alto, swift and picanto etc than buyer will suddenly increased. its size should also be increased.", "style": "2 rating", "comfort_rating": "3 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "GUGO", "model": "GIGI", "car_model": "2023 GUGO GIGI 220", "review_title": "Gigi Review", "reviewer_info": "Posted by Hassan on Apr 28, 2024", "familiarity": "Familiarity: I owned this car.", "review_text": "I am among the first few buyers of Gigi. Suneel Munj’s Gigi review on Youtube made me interested in the car. I took test drive and was thoroughly impressed. The cabin is so quiet while the acceleration of the car, especially on Sports Mode is amazing considering the size. The car makes you feel, being in a space ship while accelerating. The Range on full charge, which takes 5 hours, without AC is 160 km while with AC is 110km. The exterior design with sleek lines and curvy edges and DRLS gives it a very modern look. It has spacious interior at front however being 2 door, the persons at back gets cramped. The interior light color can also be a bother to maintain. \r\nOne more thing, Don’t compare it to Alto. The drive, feel, cabin, comfort, pick, features like Push Start, Cruise, Screen, Sensors, Rear Cam, steering etc. are far superior. The price is also reasonable, given current EV’s prices. So to summarize, I would rate this car as 9/10, being a perfect city car for a small family", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}]