[{"make": "Nissan", "model": "Bluebird Sylphy", "car_model": "2006 Nissan Bluebird Sylphy 15S", "review_title": "Best buy for Nissan lovers", "reviewer_info": "Posted by Shoaib Kamran on Jan 04, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "Currently one of the best option in market in 2 million budget.\n8-10 km/l in city  and  14-16 km/l on highway on light foot.\nComfort wise it is better than new corolla and civic.\nYou might face some issues while finding its parts but everything is available.\nRoad grip is good.\nExterior is a bit old school but interior is luxurious.\ncan be compared with toyota premio.\nBest buy for nissan lovers?", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Nissan", "model": "Bluebird Sylphy", "car_model": "2007 Nissan Bluebird Sylphy 15M Four", "review_title": "My Great Nissan bluebird sylphy", "reviewer_info": "Posted by Ali on Feb 22, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "I have recently bought a Nissan bluebird sylphy 15M Four. It is a great family car with plenty of head space and leg space and sofa seats are installed. Last week i go to Kashmir and there was alot of snow and fog. All the cars were stucked in ice and cannot view because of fog. There is optional Four Wheel Drive so i press the 4WD button and on the head light with maximum brightness and the light was cutting fog and the 4WD was working like a Suv all the Suv or jeeps were following me because of my head light. Some Nissan cars variants have optional 4WD. I tested 0 to 100 speed test. This car went to the speed of hundred in 5 second. The Engine has power of 1500cc. I prefer this car for family. This is a luxury car comparable with mercedes. The fuel economy is not perfect On long route it gives 8 to 9 Km per litre. If you are finding a family car buy a Nissan bluebird sylphy in price bracket of 9lac to 15lac.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "2 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}]