[{"make": "Toyota", "model": "Platz", "car_model": "2004 Toyota Platz F 1.0", "review_title": "owner for 15 years", "reviewer_info": "Posted by usman zafar kayani on Mar 13, 2024", "familiarity": "Familiarity: I owned this car.", "review_text": "sedan that has been as loyal as possible.  over 300k on odo. it is sublime. giving average of 15 kmpl city and 19 kmpl highway. what more can you ask for?\na perfect sedan that has gone with me to north and south equally well. suspension is great. trunk space is gracious.\nonly downside is spare parts pricing. all parts are though easily available.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Platz", "car_model": "2004 Toyota Platz F 1.0", "review_title": "Great family Car for medium sized family with good fuel avg", "reviewer_info": "Posted by Mark X on Dec 19, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "Toyota platz is an old vehicle indeed but if ypu compare it to other veh in the same price range like Mehran, Alto , cultus etc Platz is a very good deal. its a Sedan car which will allow more space and its fuel economy is exceptional.............,..........", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Platz", "car_model": "2005 Toyota Platz F 1.0", "review_title": "Toyota Platz 2005", "reviewer_info": "Posted by Rameez Imtiaz on Sep 30, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "I have had this car since 2008. It's a 2005 model imported in 2008. It's an amazing car for its price. When I first got this I was looking for Vitz but when I saw this I thought it has more utility than Vitz because of its trunk plus the engine was better than the 2005 vitz. Its exterior is not so pretty but ok as compared to Vitz of that time. The interior of the car is phenomenal which is dual tone with a lot of storage options. Its meter is designed in a way that only the driver can see the speed. The overall experience of the car is excellent the drive is very smooth, the suspension is excellent even if you compare it with locally made cars of 2021. Its fuel economy is also good giving around 13 kmpl with  AC in the city and 14.5 without AC in the city. On the highway its mileage is 19 kmpl with AC and 21 kmpl without AC. To this day I enjoy driving my car.", "style": "3 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 1 person found this review helpful)"}, {"make": "Toyota", "model": "Platz", "car_model": "2002 Toyota Platz F 1.0", "review_title": "Value for money", "reviewer_info": "Posted by Ahsan Ashraf on Feb 25, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "I used Toyota Platz 2002 for almost 10 years. A good car with safety features. Strong body, parts are easily available, low maintainance, great fuel average 13\\14 in city without A/C and 15/16 on highway. Engine power is not great but fine for use in city. A/C is good. large trunk space. A proper family car in reasonable price.", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Platz", "car_model": "2003 Toyota Platz F 1.0", "review_title": "Toyota Platz 1000 review", "reviewer_info": "Posted by Anonymous on May 03, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior is fairly designed. Headlights look nice but the curves on the sides look ugly. Rear lights look ugly too. Otherwise exterior is nice.Bonnet is fairly sized. Its not very big nor very small. Both bumpers look decent and not ugly. The exterior is nice and resembles alot with Toyota Vitz 1st Gen. Interior is not very big. Even though its a sedan the leg room is poor for both front and rear seats. Seats are soft. Very under featured car. However fuel economy is excellent and ride quality is actually harsh. Acceleration is poor but in a range of 6-8 lacs the car is a very good option. Also Parts are easily available and are cheap. It has ABS Brakes which are the best brakes i've ever witnessed.", "style": "3 rating", "comfort_rating": "3 rating", "fuel_economy": "5 rating", "perfomance": "2 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(1 out of 2 people found this review helpful)"}]