[{"make": "FAW", "model": "Sirius", "car_model": "2016 FAW Sirius S80 Grand 1.5", "review_title": "FAW Sirius as a owner", "reviewer_info": "Posted by Dr Sohail Nadeem on May 07, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "I am using FAW sirius from last two years, i am not satisfied with this car, FAW company needs lot of improvements. The usual thinking about the chinese products are not good in our community , which is because these are low quality. FAW is very low quality , I am trying to cell my car from last two years but no one is interested to purchase even company own dealers cannot help to cell it. I have purchased it in 1907000 plus registration now i am selling about 16.5 but found no response even every thing is genuine and only 30000 km driven in Islamabad Roads.", "style": "1 rating", "comfort_rating": "1 rating", "fuel_economy": "1 rating", "perfomance": "1 rating", "value_for_money": "1 rating", "overall_rating": 1, "helpful_votes": "(6 out of 6 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2014 FAW Sirius S80 Grand 1.5", "review_title": "Good compare to Avenza", "reviewer_info": "Posted by Tariq Shah on Jan 24, 2017", "familiarity": "Familiarity: I owned this car.", "review_text": "Faw Siruis is better then Avenza becuase faw price 19 lac and Avenza price is 30 lac\r\n\r\ni used this car from last 2 years and Alhamdu Lilah till today not visit any workshop and face any trouble till today \r\n\r\ntravel  Naran, Kaghan, etc \r\n\r\nGood Experience", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(5 out of 5 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2016 FAW Sirius S80 Grand 1.5", "review_title": "Test Drive FAW Sirius S80", "reviewer_info": "Posted by ali on Mar 08, 2016", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "I visited FAW South Motors KHI on March 04, 2016 &amp;had a test drive of Sirius Grand. My Observations are as follows:\r\n1-\tSirius 1.3 has been discontinued. 1.5 Grand is the only variant available\r\n2-\tImported from South Arica \r\n3-\tExterior is good &amp; likewise an SUV. Better than Avanza &amp; APV\r\n4-\tInterior is not as good. Plastic is of inferior quality, seats are very hard, Power steering was not fully functional (very hard) and also not adjustable \r\n5-\tGear shifting was too hard. Pickup was not smooth. It was moving like a 1.0 cc car instead of 1.5 cc, missing acceleration \r\n6-\tPower windows were too slow, indicator assembly on left side &amp;wiper on right side\r\n7-\tOld Toyota Vitz 2003 series engine\r\n8-\tSalesgirl on FAW South was very attentive but rest staff was not supportive to her\r\n9-\tDuring test drive, their technical person remained least bothered about selling \r\n10- Very low resale value. \r\n11 - After-sales service is not as good as Pak Suzuki\r\n12- Parts available in Market", "style": "4 rating", "comfort_rating": "2 rating", "fuel_economy": "2 rating", "perfomance": "2 rating", "value_for_money": "2 rating", "overall_rating": 2, "helpful_votes": "(4 out of 4 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2014 FAW Sirius", "review_title": "MY FAW SIRIUS", "reviewer_info": "Posted by Hammad Ahad Razi on Sep 29, 2015", "familiarity": "Familiarity: I owned this car.", "review_text": "I have SIRIUS S80 1.3, Since 1 Year, Facing Lot of Problem after Sales Service, like; Proper Engineer not available on the designated workshops, Parts Availability is very Poor etc. I visited FAW Punjab Motors, FAW Sajjad Motors Jail Road Lahore and FAW Momentom Motors Quenz Road Lahore. Only Momentum Motors is batter choice other two. FAW Sajjad Motors Staff are very illiterate they didnt know the FAW vehicles all workers work on Hit and trial basis, I had personally experience this workshop. If FAW want to success in Pakistan then must provide after sales services properly.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(3 out of 3 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2015 FAW Sirius S80 Grand 1.5", "review_title": "Grand Sirius", "reviewer_info": "Posted by Omer Farooq on Aug 10, 2015", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior &amp; Interior same as Avenza (Toyota).\r\nFuel Economy is 10-12 Km/L\r\nAll specs of Avenza are also available in Sirius.\r\nInfact its the same car, just some business deal broke with FAW and they launched the same car with different name.\r\nEngine Type and Model is same.\r\nBrakes same\r\nDual A/C by Sirius Grand.", "style": "5 rating", "comfort_rating": "3 rating", "fuel_economy": "2 rating", "perfomance": "3 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2015 FAW Sirius S80", "review_title": "faw sirius s80 and grand", "reviewer_info": "Posted by rai naseem bhatti on Mar 03, 2015", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "Yesterday i went to faw motors sargodha and i saw it.amazing exterior awsom great charm with modern stylish looks.in an economical price with almost all features of modern day cars.front rear ac front fog lights plus rear view camera with 7 persons seating capacity.a good interior with euro4 engine.power steering lot of inner space more hight width and length then toyota avenza which is in 2.9 million.sirius 1.3l price 1.7 million and sirius grand price is 1.9 million.although i never understood why people are less interested in buying faw vehicles.i suggest u must try both these  mini crusers.regards.rai naseem ahmed bhatti.", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(5 out of 6 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2014 FAW Sirius S80", "review_title": "It seems but not good", "reviewer_info": "Posted by muhammad abubakar on Aug 14, 2014", "familiarity": "Familiarity: I have neither owned nor driven this car.", "review_text": "Yesterday I visited FAW MOMENTUM MOTORS LAHORE.\r\nI was really excited to have a live look upon FAW Sirius but, seriously it was really disappointing.\r\nFirst of all because, its market value isn't great or profitable.\r\nAnd secondly the worst kind of seats.\r\nExterior is good+ Interior is also fully featured but, it is not a valuable SUV.\r\nThe petrol consumption is ok with 14km/l as the dealer instructed.\r\nI prefer you to just visit and see the car in white at FAW MOMENTUM or go for TOYOTA RUSH because, its much better.", "style": "5 rating", "comfort_rating": "1 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(1 out of 2 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2013 FAW Sirius S80", "review_title": "Reasonable Value for Money", "reviewer_info": "Posted by Rana Tariq  on Nov 13, 2013", "familiarity": "Familiarity: I have neither owned nor driven this car.", "review_text": "I was excited to know about this new car in Pakistan so I went over to FAW Punjab Motors at Multan Road to see it for myself. They had the olive green model on display. I inspected the car thoroughly. Initially I was of the opinion that it was good value for money. But close inspection showed otherwise. I think a fair price for the car considering the quality of the material used in the car is around 15 Lakh at the most. The quality of the rear seats is definitely not one that you would like on a long ride, which is what these cars are intended for. The seats are basically stiff and of very poor quality. However, the good thing is that they are held by two nuts only and thus can be changed. The doors close a bit too loud and the side view mirrors are shaky - something reported by a South African user as well. The gear box is basically cheap as well. On the positive side, the headlights and the LED side indicators are cool. Also it comes with dual airbags, ABS and a powerful AC.", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(3 out of 7 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2013 FAW Sirius S80", "review_title": "Siriusly FAW", "reviewer_info": "Posted by Aqib Khan on Oct 23, 2013", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "The Sirius is based on the design of the previous Toyota Avanza, which is arguably more attractive than its successor. There is only one seven-seater in the range, and it must be said that its generous level of equipment comes as a big surprise. It comes with alloy wheels (including the spare wheel), remote central locking, ABS with electronic brake distribution, dual airbags, electric windows all round and LED indicators in the electrically-adjustable door mirrors as standard equipment. A rear window wiper is conspicuous by its absence, which is a shock considering that the Sirius is otherwise very well-equipped. There is a demister on the rear window, which helps a bit, but a wiper is essential in heavy rain. There is an MP3-compatible radio with a USB port, but because there is no CD player, you have to load your music onto a flash drive. This does not suit everybody, and a CD player is still an essential feature of any sound system in my honest opinion. There are head rest", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(8 out of 9 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2013 FAW Sirius S80", "review_title": "New FAW Sirius 2013", "reviewer_info": "Posted by Shahab Uddin on Oct 15, 2013", "familiarity": "Familiarity: I have neither owned nor driven this car.", "review_text": "Dear friends,\r\nThe New FAW Sirius 2013 is nicely packaged by Al-Haj &amp; Faw Motors exterior is eye catching but I am disappointed with interior after reading  out user feedback's of south africans about FAW Sirius are not encouraging at all currently its priced  at 16.99 lacks factory price! in opinion in 17 lacks this is not my choice although suv is designed nicely its 6 out of 10", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(4 out of 6 people found this review helpful)"}, {"make": "FAW", "model": "Sirius", "car_model": "2013 FAW Sirius S80", "review_title": "A good value for money vehicle", "reviewer_info": "Posted by Usman Iftikhar on Sep 25, 2013", "familiarity": "", "review_text": "Exterior: Stylish and Elegant Exterior\r\n\r\nInterior (Features, Space &amp; Comfort):\r\n Stylish Console, with regular gadgets alongwith dual airbags makes it a good buy. 7+1 seating capacity makes it bigger in its category.\r\nFuel Economy:\r\n\r\nRide Quality &amp; Handling:\r\n15 inch alloys with Kumho imported tyres gives a good handling with ebd and abs .\r\nFinal Words:\r\nGood Value for Money.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(9 out of 16 people found this review helpful)"}]