[{"make": "Mitsubishi", "model": "Pajero Mini", "car_model": "2010 Mitsubishi Pajero Mini Limited", "review_title": "nissan kix  Excellent value to money", "reviewer_info": "Posted by Ahmad Raza on Mar 28, 2023", "familiarity": "Familiarity: I owned this car.", "review_text": "I bought it a year ago. It's a good car according to price range. It's doesn't have a highly design interior but it's have all the basic features which every car must have. It's 660 cc turbo and have a very powerful engine. It's a 4×4 . Good option for off roaders. Every mechanic know about it. It's almost like a mini pajero, almost bolt to bolt same. Soo it's not difficult to source a parts in Pakistan", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Mitsubishi", "model": "Pajero Mini", "car_model": "2011 Mitsubishi Pajero Mini Limited", "review_title": "NISSAN KIX 2011", "reviewer_info": "Posted by anas on Sep 03, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "body shape is very good\n660cc turbo engine can give good ride but fuel economy is not gud over all car material is also gud plus point is 4x4 mode from which car cannot stuck in mud and water overall car is very good but resale value is not gud.i have owned this car from around 3 months i realize that this car give me comfort like a luxury car but because of 660cc engine it cannot go on long route easily engine is 660cc but it gives more power as 1000cc car", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "2 rating", "perfomance": "3 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Mitsubishi", "model": "Pajero Mini", "car_model": "1994 Mitsubishi Pajero Mini XR", "review_title": "Mitsubishi Pajero Mini XR II", "reviewer_info": "Posted by Abdul Rehman on Sep 24, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "I've got all the history of the car saved in my Evernote which i can show you got it used and driving for over 2 and a half years fixed a lot of issues thats how i know this car very much Had a heating problem then i suffered through the AC problem Then Engine got replaced from 660cc to 1100 cc so i had Computer matching problem then little bumping and crashing in problems and all that i fixed Alhamdulillah. then i took this car all up in the northern areas for real off roading and came back all safe Alhamdulillah.", "style": "2 rating", "comfort_rating": "3 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 3, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Mitsubishi", "model": "Pajero Mini", "car_model": "2010 Mitsubishi Pajero Mini VR", "review_title": "Great buy", "reviewer_info": "Posted by Waqar Ahmed on May 14, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Mitsubishi Pajero Mini is  stylish suv.it comes with 650cc, 16 valves, EFI Engine.Comfort is good, suspension is average, ground clearence is very good, Its fuel efficiency is 11-13 Km/1lit in city with AC while it gives 13-15 Km/1lit on long journey depending on driving style. Driving posture is very amazing. Exterior look is very remarkble. It comes with some other good features like power steering, power window, a good AC, head unit witb back camera, we can conclude that is a car for the Auto lovers.", "style": "5 rating", "comfort_rating": "3 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Mitsubishi", "model": "Pajero Mini", "car_model": "1995 Mitsubishi Pajero Mini", "review_title": "Pajero Mini 660 Turbo VR II Manual Transmission 1995", "reviewer_info": "Posted by Hamzah on Oct 10, 2016", "familiarity": "Familiarity: I owned this car.", "review_text": "I had this car for around 5 years, until I sold it in 2016. This is a very good vehicle for short range commuting. Ideal for bachelors, or a very small / young family that just got started... \r\n\r\nVery powerful on the 4x4 scene, especially when offroading on LOW 4 selection. \r\n\r\nHigh revs make this car heavy on the economy (around 9 km/l - but different cars may vary on the mileage).\r\n\r\nI would however not recommend this where intercity travel (highways, motorways etc.) is required, for this vehicle is not intended for high speed / sustained driving. \r\n\r\nAlso, watch out for oil issues in this car if the engine / seals etc. begin to drip over. I drove the 5 forward manual transmission, but felt at times it needed another gear... the engine is quite on the upside for its noise.\r\n\r\nA good experience overall, and value for money in shape of small SUV. A reasonable AC, powersteering and 4x4 ride.\r\n?", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "1 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 3, "helpful_votes": "(3 out of 3 people found this review helpful)"}]