[{"make": "Chevrolet", "model": "Spark", "car_model": "Chevrolet Spark SE Automatic", "review_title": "Why not?", "reviewer_info": "Posted by altaaf ahmad on Mar 17, 2011", "familiarity": "", "review_text": "why not its a good dolly car, stylish and at least best one from suzuki stuff , althogh the price is a bit high but , its not due to the company , its due to khappeey bhai, for who have done one thing in pakistan more and more texes, \r\ni tried this car and found it a good one , best from at least mehran , cultus, alto, dihatsu stuff....", "style": "5 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(3 out of 6 people found this review helpful)"}, {"make": "Chevrolet", "model": "Spark", "car_model": "Chevrolet Spark LS", "review_title": "Best Value for Money", "reviewer_info": "Posted by Ayaz Khan on Nov 05, 2009", "familiarity": "", "review_text": "I purchased this car some 2 months back after comparing specifications of Cuore, Alto and Cultus. I was looking for some small size car ... obviously because of garage parking issue :).<br>\n<br>\nWas a little conscious because Chevorlet didn't allow test drive --- hence no verification on their claims. But was confident because of its foreign assembling and after reading a bit on Internet.<br>\n<br>\nThis turned out to be a joy ride over last 2 months. I am totally satisfied with luxurious feel of the car. The details, finishing is good ... no loose ends. <br>\n<br>\nInterior is well designed, best usage of space you will find places to keep you wallet, mobile, coffee cup, water bottle, loose papers, tissue box and all in reach of hand.<br>\n<br>\nComfort while driving is great for this size car. Spacious in front -- real comfortable.<br>\n<br>\nBack seats are relaxing with ample leg space. Drive from Lahore to Peshawar on motorway was not tiring.<br>\n<br>\nA/C is perfect for 800cc car, even better than 1000cc (comparing to Cultus).<br>\n<br>\nIts MTect-II 800cc engine by no means an 800cc engine, you can easily compare the performance with a 1000cc engine.<br>\n<br>\nExteror, body shape/strength all are good for this scale car. <br>\n<br>\nFuel consumption is approx 12km/litre in city and 15km/liter on motorway. The claim was 18km/litre. So it failed here. But still worth it. At 140km/h it is stable drive. The pick and speed is not that much effected by running A/C.<br>\n<br>\nAbove all it is with 2 yrs warranty or 50,000km which ever comes first. The knob to adjust fan speed had few problems after 1 month or purchase ... it was a connection solding issue, which i got fixed from a 3S dealer in no time. Staff was trained.<br>\n<br>\nDo not go for Chevorlet Joy --- Spark is much better than that.<br>\n<br>\nI will say best value for money, I am happy to pay Rs. 40,000 extra for this comparing to Cuore. I am a satisfied driver of Spark --- Alhamdu Lillah.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "3 rating", "overall_rating": 5, "helpful_votes": "(24 out of 25 people found this review helpful)"}]