[{"make": "Suzuki", "model": "Vitara", "car_model": "2018 Suzuki Vitara GLX 1.6", "review_title": "Review of Suzuki Vitara GLX  2018", "reviewer_info": "Posted by Atif Ilyas on Dec 16, 2023", "familiarity": "Familiarity: I owned this car.", "review_text": "I am using this compact SUV since Feb 2022. I am really satisfied with its build quality, features, reliability, driving modes and many other features. The difference of locally assembled and  imported vehicle is very clear.  I recommend this vehicle for the persons who want to retain vehicles for years like me. I tested its performance on smooth roads, bumpy roads, mountain, steep descends , snow, mud, and even desert of Shiger, Skurdu. Fully satisfied with this vehicle.  The negative aspect is that length  is little bit less (4300mm should be the best).", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2017 Suzuki Vitara GLX 1.6", "review_title": "Value to Money", "reviewer_info": "Posted by Azwer on Jun 27, 2021", "familiarity": "Familiarity: I owned this car.", "review_text": "im really much comfortable with my suzuki vitara, even though i try mg hs and sportage also. this is valur to money compact SUV and having europian standards which never be competed by all asian vehicles.  this one is all grip and awesome drive as well as cimfortable and jango pick ...", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2018 Suzuki Vitara GLX 1.6", "review_title": "Best Compact SUV Ever", "reviewer_info": "Posted by Ali Zain Malik on Nov 04, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior of car gives a luxury as well as sporty look.Better for off-roading than sportage.\nOwned this car in 2018.\"GREAT EXPERIENCE\"\nIn August 2020 i bought Kia Sportage AWD.\nSuch a bad experience after paying 6M\nVitara comes with a 1.6L vvt engine which truly competes 2.0L engine of sportage or tucson.Parts are easily available at very low prices as compared to Tucson.Moreover car has exellent safety features like 7airbags.Yet interior of car gives an average look but better as compared to the interior of Sportage. Excellent Panoramic sunroof .No water leakage issue like panoramic sunroof of Sportage.\nGood fuel economy.12-13.5 with AC in city and 14-15 on long .\nExcellent and comfortable suspension.\nVery large boot space. Best pick and acceleration ever in 1.6L.Outstanding performance and ground clearance you don't have to worry on any  speed breaker.\nAt last i would like to say that Suzuki Vitara GLX 4X4 is an excellent compact SUV in luxuries as well as sports and off roading.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2018 Suzuki Vitara GL+ 1.6", "review_title": "Vitara", "reviewer_info": "Posted by Anonymous on Sep 01, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "The car is worth the money. The best SUV that Pakistan has as compared to the other SUVs[KIA]. It has been almost 2 years that i have been using this car. its furl average is good. I was not expecting that this SUV will be good because of the band. the most important thing is that the car is imported  and the built quality is good. The car do not cost that much maintenance . Being an SUV the comfort is good for the front seats but  the back leg space is less.", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2017 Suzuki Vitara GL+ 1.6", "review_title": "Vitara The best first step for a first time SUV buyer", "reviewer_info": "Posted by Anonymous on Dec 10, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "1) The size of the vehicle is optimal for anyone who is used to driving sedans like corolla\r\n2) The engine is a 1600cc and provides the fantastic fuel economy while retaining all  functions of a SUV\r\n3) Vitara is not made in Pakistan its the only European car that is imported in Pakistan and has a full 3s dealership service support\r\n4) 6 Air bags.... OH YES.... not even the most expensive local produced cars have that many air bags\r\n5)  Low maintenance cost and why is that because its a Suzuki with a 1600cc engine  and is as cheap as maintaining an GLI or 1.6 corolla.\r\n\r\nWhats bad about it....\r\nWell  its a SUZUKI and if  you are a person who are fine with the quality of produce instead of its emblem then its the best buy at the given price range.\r\nParts are expensive because its a European import \r\nResale is going to be slow as the car attracts limited users", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "5 rating", "overall_rating": 3, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2017 Suzuki Vitara GL+ 1.6", "review_title": "Suzuki vitara 2017 model", "reviewer_info": "Posted by Tasadduq Nabi  on Dec 07, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "The exterior of the car is very beautiful and spacious it looks like a range rover evoque the cars interior design is very roomy and comfortable the car has a 1.6 liter engine and is a awd car the stairing wheel has cruise control paddle shifters the car gives Good fuel economy in city and on Highway", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2017 Suzuki Vitara GL+ 1.6", "review_title": "The Poormans RangeRover", "reviewer_info": "Posted by Anonymous on Nov 27, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "For people who have never owned a  4x4 vehicle ever Vitara comes out to be the perfect choice\r\nIt has all the bells and whistles that you would need in a  nippy 4x4  vehicle with a limited off road capability and also very functional city and touring vehicle\r\nTHe car looks like a version or Range Rover vogue with a Suzuki badge though\r\n1.6  sounds less but car weighs only 1147 kgs considering the fact that a corolla 1.3 weighs 1300 kg the 1.6 for Vitara is more than enough\r\nFantastic fuel average 14.5 if you drive it like you own it not stole it.\r\nready for every terrain that you can throw at it as long as its not off the cliff.\r\nCutting the long story short its the best car in the segment which is simple and is based on simple 4x4 engineering rather than electric motors and Space ship technology  if you want a long term keeper  Vitara is a no brainer", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2017 Suzuki Vitara GLX 1.6", "review_title": "Unexpectedly good", "reviewer_info": "Posted by Huzaifa Arif on Nov 06, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Very pleased with the quality of vitara never expected such from Suzuki even tho it's an imported vehicle, the drive he quite smooth and it feels like driving a powerful car not as driving a 1.6. Much better in comparison with brv and vezel. A daily driven family car that provides you with comfort and extra bit of luggage space, wouldn't be hard for your pocket to handle as the fuel economy is very good both in city and long travel while it's maintenance cost is not that high as well", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "3 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2018 Suzuki Vitara GLX 1.6", "review_title": "A car that justifies its price tag", "reviewer_info": "Posted by Anonymous on Jul 03, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Well, to speak of its exterior; it's a bit sporty than its previous models and has resemblance with range rover as people say. Build is good, so is the ground clearance. \r\n\r\nPerformance being an utmost important concern, this crossover is in a way better than its competitor Honda Vezel and in some comparisons it lags too. Like the suspension I must quote is way better than that of Vezel but the acceleration wise Vezel takes the lead and that however is because of that car being a hybrid equipped. \r\n\r\nFuel economy is as good as a sedan and at times better, even. Depends how hard you're on the pedal. Also the driving modes will impact the collective fuel economy. Sports will give you an ultimate driving performance and pleasure but at the cost of burning more gas than Normal Auto mode. \r\n\r\nInterior I'd say gives a rugged look, not kind of a modern style. It's a bit of timeless design philosophy that some designs won't get obsolete. Like analogue clock and climate dials", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2018 Suzuki Vitara GL+ 1.6", "review_title": "4x4 powerful SUV", "reviewer_info": "Posted by Hamza on Feb 08, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Suzuki vitara is a powerful SUV in Pakistan with many more function like cruise control and paddle shifters and 4 air bags with multimedia steering and 10 inch android Tab only one missing in SUV back camera is miss but overall excellent vehicle with 1.6 litre engine", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2017 Suzuki Vitara GL+ 1.6", "review_title": "Vitara a true value for money", "reviewer_info": "Posted by Anonymous on Sep 19, 2017", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior.  Very sporty and muscular.\r\nInterior: I personally feel the spacious interior of the Vitara redefines Compact SUV comfort and driving intelligence, with a high level of finish throughout. Has got an excellent all round view and a high driving position\r\nPerformance: It is extremely responsive car just need to floor the gas pedal. In Sports mode the car is very agile and with plenty of oomph.....Pedal shifters are a joy to use. The engine is \"Very Capable\".\r\nAllGrip (4WD)\r\nThe all new Vitara comes with ALLGRIP, Suzuki’s fully integrated 4WD system, that maximizes road grip. One can choose from four driving modes: ‘Auto’, ‘Sport’, ‘Snow’ and ‘Lock with one turn of the dial.. This system lets you rediscover what the compact SUV was always designed for: all-out adventure\r\nGreat fuel economy for such a capable car. \r\nOverall, I am in love with this car and feel thrilled and excited whenever I am behind wheel. Once in Vitara you feel like sitting in a much more luxurious car.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(3 out of 3 people found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2017 Suzuki Vitara", "review_title": "It is good stuff for passionate person", "reviewer_info": "Posted by Anonymous on Aug 22, 2017", "familiarity": "Familiarity: I owned this car.", "review_text": "It is same as rangerover \r\nWhen I purchased  I was confuse due to brand of Suzuki but after ride and use of it, it change my perception  it is really a good stuff\r\nAll needs of mine are Fulfill \r\nEvery one who seen is appreciating and I am also happy with this", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(1 out of 2 people found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2017 Suzuki Vitara GLX 1.6", "review_title": "A small SUV", "reviewer_info": "Posted by Pakwheels User on Feb 07, 2017", "familiarity": "Familiarity: I have neither owned nor driven this car.", "review_text": "I was really interested in Vitara till I saw it myself in the showroom. It is considerably small and has very little leg room for back seats too.\r\nMany options have been included in it which attracted me but the overall size, small engine (1.6 Liters) and little leg room in back seats have  changed my mind. A little bigger in size would have done it for me.\r\nI don't know how good a 1.6 L engine car is good at 4wd.", "style": "5 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(3 out of 5 people found this review helpful)"}, {"make": "Suzuki", "model": "Vitara", "car_model": "2016 Suzuki Vitara", "review_title": "Space", "reviewer_info": "Posted by Pakwheels User on Jan 15, 2017", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "This car have limited space person . It should be for 8 person not 5.. otherwise it is beautiful.\r\nExterior design is also very impressive nadi looking cool. Interior style also catch the rider attarection. It is really good comfortable car.\r\nMy mind to own this car but it has limited space person.", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "5 rating", "value_for_money": "2 rating", "overall_rating": 3, "helpful_votes": "(2 out of 5 people found this review helpful)"}]