[{"make": "Isuzu", "model": "D-Max", "car_model": "2019 Isuzu D-Max V-Cross Automatic 3.0", "review_title": "Great buy", "reviewer_info": "Posted by Zain  on Feb 06, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "Stylish exterior. Simple and elegant interior with all the latest luxuries available. Sound system is amazing with surround sound. Comfort and road grip is way better then any other truck available in this price tag in Pakistan. I have been driving double cabins since my childhood but never felt so happy and satisfied. I sold my Hilux Revo which I drove 70,000 Kms just to buy this awesome machine. Now I have driven Dmax almost 17000 with or without load in almost all terrains. It never gave me any kind of Problem. I even travelled to from Islamabad to Karachi 2 times in this, never got tired like I use to get tired while driving Toyota Hilux. Highly recommended to all the SUV and truck loving people. This car won't disappoint you.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Isuzu", "model": "D-Max", "car_model": "2019 Isuzu D-Max V-Cross Automatic 3.0", "review_title": "Great buy", "reviewer_info": "Posted by PWUser157372956189 on Nov 14, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Stylish exterior.  Simple and elegant interior with all the latest luxuries available. Sound system is amazing with surround sound.  Comfort and road grip is way better then any other truck available in this price tag in Pakistan. I have been driving double cabins since my childhood but never felt so happy and satisfied. I sold my Hilux Revo which I drove 70,000 Kms just to buy this awesome machine. Now I have driven Dmax almost 17000 with or without load in almost all terrains. It never gave me any kind of Problem. I even travelled to from Islamabad to Karachi 2 times in this, never got tired like I use to get tired while driving Toyota Hilux. Highly recommended to all the SUV and truck loving people. This car won't disappoint you.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Isuzu", "model": "D-Max", "car_model": "2019 Isuzu D-Max", "review_title": "Way More Better Than Competitors", "reviewer_info": "Posted by Anonymous on Oct 17, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Personally drove the car and believe me much better then other compete one, Eye Catching Design  and Lush interior make her superior to others one.\r\nI am happy with the performance, average and style.\r\nHighly Recommended.\r\nTraveled to Northern areas, deserts rallies and always found the performance on its peek.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Isuzu", "model": "D-Max", "car_model": "2019 Isuzu D-Max V-Cross Automatic 3.0", "review_title": "Great buy worth the money", "reviewer_info": "Posted by Muhammad Ali Tauseef on Aug 05, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Awesome machine 10/10 in all comfort,power and economy worth it.It has all the great features and the engine response is very good but the thing it lacks is cruise control which the company says they will introduce in the next coming years and one more thing is that the tyre pressure monitoring system is not yet installed in the car it is only an app it does not work. All in all it is a very good 4×4 machine which makes its place against its competitors such ad revo and navara.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Isuzu", "model": "D-Max", "car_model": "2019 Isuzu D-Max V-Cross Automatic 3.0", "review_title": "The Beast", "reviewer_info": "Posted by Abbas Dosten Hote on Jul 21, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "D-Max also called the Beast in international market is an excellent addition to Pak market. D-Max stands for Durability Maximum and from my experience so far it is spot on! It not only broke Toyota's hegemony and monopoly but gave Pak consumers a choice for a true 4x4. D-max is a great value for money and considering it's reputation in the international market as the leading selling pickup truck, the price differential between Revo and D-Max is substantial. D-Max is also a bargain if compared with Civic in current scenario as well as with Sportage.The styling of D-Max is very bold and aggressive and is a head turner. I've been driving my V-Cross since April 2019 and have driven it extensively. People have been coming up to me to ask about it and when I tell them it's made in Pak they are pleasantly surprised. The build quality is impeccable.", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Isuzu", "model": "D-Max", "car_model": "2018 Isuzu D-Max V-Cross Automatic 3.0", "review_title": "V cross dmax", "reviewer_info": "Posted by Anonymous on Nov 25, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "The exterior is very attractive and interior is very smart and decent.\r\nThe ride is extremely comfortable for a pick up and leg room is also more than any other pick up available in Pakistan.\r\nFuel economy in the city is around 11 Km per litre and on highway is around 13 km per litre.\r\nI am really enjoying this new dmax which has good acceleration and awesome grip .", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}]