[{"make": "Toyota", "model": "Camry", "car_model": "2015 Toyota Camry Hybrid", "review_title": "Best luxury and no maintenance just get some fuel and enjoy the ride", "reviewer_info": "Posted by Mayed The vlogger on Apr 07, 2023", "familiarity": "Familiarity: I owned this car.", "review_text": "All genuine 2015 new shape top of the line all adas features sunroof multimedia system good average it is a worth buying car because in this budget you can have n Audi A4 which got quite maintenance issues this car as being a model of a well being name Toyota got no maintenance issues just enjoy the comfort and ride", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "2011 Toyota Camry Up-Spec Automatic 2.4", "review_title": "Best selling car in US", "reviewer_info": "Posted by Anonymous on Jul 25, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "I am based in the US and own a 2011 Camry SE 2.4. \r\nIts the sporty version of Camry. It is different from the regular Camry as it has dual exhausts, 15% stiffer suspension, 3-spoke steering wheel, front air dam, side skirts, rear spoiler, rear bumper skirts.\r\nStyling is a personal thing, I think its a nice looking car and looks nice even now, after almost 8 years.Noticeable features in this Camry are 4-auto-up/down windows, JBL 6-in-dash-CD changer, 8 airbags including knee air bag, great bluetooth connectivity, LED tail lights, 6-speed automatic transmission. Acceleration, braking &amp; fuel economy are mid pack.  Consumes approx. 10km/l in city with AC and 14km/l on highway of average driving with automatic transmission. Some good features to cut down maintenance cost include hydraulic valve adjusters, automatic v-belt tensioner. I  wish it was less noisy at speed.   You can check out a few of my videos", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "2010 Toyota Camry Up-Spec Automatic 2.4", "review_title": "style", "reviewer_info": "Posted by Khurram Barlas on Jan 25, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "i think it is a vip car because it is a classic car goog style performance is best it is a best family car i think it experience but good i have driven this car 200000 km i have best experience with it.It has good features it has sunroof power window power steering power mirror push to start keyless entry", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "2005 Toyota Camry", "review_title": "Great car but bit over priced in Pakistan", "reviewer_info": "Posted by Mukhzar Mehmood on May 11, 2017", "familiarity": "Familiarity: I owned this car.", "review_text": "great car i own 2006 model and it is working just fine i have driven it 190000 miles. shockingly comfortable car  with considerable fuel economy at no point  in city or freeway i felt lack of power. Good Stereo, good trunk capacity and after all it is toyota so cheap maintenance, great road grip. over all this car is 4/5", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "5 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "Toyota Camry Up-Spec Automatic 2.4", "review_title": "Experience", "reviewer_info": "Posted by Haroon on Sep 05, 2012", "familiarity": "", "review_text": "Toyota Camry is a well renowned brand all over the world due to its reasonable price and reliability stats. Then again in Pakistan; we are a little different then the rest:). Here  its among the best cars available from the Company. We get only 2.4 version with almost basic trim while in Australia and other countries it also comes in 3.0. This car has a descent history in Pakistan.\r\n\r\nOverall:\r\nThis car overall has nice lines, comfortable interior, descent looks and its among the more reliable cars. It wont feel under powered if not powerful and does have good road grip and a feel for the driver. While one negative aspect is that it does not have that low center of visual gravity like other cars.\r\n\r\nPerformance:\r\nIt comes in 2.4L and wont feel under power in any regard. The maintenance is least although a little bit expensive. The car is responsive and feels great as a daily driver. The ride is comfortable and pleasant while at times braking on wet surfaces might get it a little off balance. The car has Electronic Power Steering (EPS), Anti-Lock Braking (ABS), Electronic Brake Distribution (EBD). While this particular trim does not have any Vehicle Assistance or Stability Controls.\r\n\r\nInterior:\r\nInterior is in beige and comfortable with 8-way supportive seat, electronic driver and passenger seat. Comes with sunroof, 6 in-dash cd/mp3 player with steering buttons. It has automatic climate control and the A/C is a class of its own and comes with ion filter, which wont stress engine even if driving uphill and does not either effect fuel economy. It has auto-headlamps and rain sensing wipers which are convenient features. The interior is nicely laid out with everything in total reach of the driver. Car comes with pinch-free Auto Glass side mirror and retractable and auto side mirror. The car has a built in security system with immobilizer and security alarm.\r\n\r\nMileage:\r\nLocal with A/C 9-9.5 km/L\r\nLocal without A/C 10 km/L\r\nHighways with A/C 12-12.5 km/L\r\nHighways without A/C 13km/L\r\nThe mileage is descent provided driving the car with slightly heavy foot.\r\n\r\nPros:\r\nDescent engine with good mileage and power band\r\nComfy and spacious interior\r\nA daily driver\r\nGood sterio system\r\n\r\nCons:\r\nExpensive parts\r\nWet braking is at times an issue\r\n\r\nPrice:\r\nThe price of Camry in Pakistan started at around 23 Lacs which was just perfect but now it is almost touching 96 Lacs for the new model which has new shape and some new feature but that just does not compensate for 70lacs + of price hike.\r\nI might settle for Mercedes Benz C or E class, may be Toyota Mark X 3.0g and there are a lot of other options.", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(2 out of 2 people found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "2011 Toyota Camry Up-Spec Automatic 2.4", "review_title": "toyota camry", "reviewer_info": "Posted by fanofcars on Aug 26, 2012", "familiarity": "", "review_text": "it is a good luxury vehicle, it is a 2400cc luxury car.and its performance is very very good.it is chosen by families mostly as compared to the other luxury cars which are about 2400cc.it shape is very good.its silver and black colour is most attractive as compaered to the other colours.i recomended to the peoples this car ,who searched for any luxury vehicle.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "2011 Toyota Camry Up-Spec Automatic 2.4", "review_title": "Toyota Camry", "reviewer_info": "Posted by Ikramswat on May 28, 2011", "familiarity": "", "review_text": "Toyota Camry is a great car.I am having the pleasure of Toyota Camry for three years.In these three years I have never experienced any problem.The New look of Camry is amazing.Fuel Economy is also great.Anyone who wanna buy luxury car dont forget camry.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(3 out of 3 people found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "Toyota Camry Up-Spec Automatic 2.4", "review_title": "NICE CAR", "reviewer_info": "Posted by hussnain1ali on May 20, 2011", "familiarity": "", "review_text": "I OWN A TOYOTA CAMRY HYBRID SUCH A NICE CAR BOUGHT IT NEW I YEAR BACK AT A PRICE OF $25000 AUTO TRANSMITION FUEL ECONOCIMIC AND COOL INTERIOR IT IS 2.5L AND VERY POWERFUL THAN IT,S RIVALS SONATA GLS AND HONDA ACCORD AND NISSNA ALTIMA NICE CAR AT MONEY IMPORTING ONE TO PAKISTAN LIVING IN US WILL COST ME AROUND $38000 in pakistan comfortable in its class nice car hybrid suckss.", "style": "3 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "3 rating", "overall_rating": 4, "helpful_votes": "(1 out of 2 people found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "Toyota Camry Up-Spec Automatic 2.4", "review_title": "Too bad", "reviewer_info": "Posted by Nomi on May 10, 2011", "familiarity": "", "review_text": "80 lacs for a \"luxury\" car that doesnt even have parking sensors and tv / navigation screen. Why do people buy it? WHY? You can get a luxury suv in this price with 20 times more features as in this UAE Taxi car. Or you can get a good luxury sedan for HALF the price, again with 20 times more features.", "style": "2 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "1 rating", "value_for_money": "3 rating", "overall_rating": 2, "helpful_votes": "(3 out of 5 people found this review helpful)"}, {"make": "Toyota", "model": "Camry", "car_model": "Toyota Camry Up-Spec Automatic 2.4", "review_title": "Upgraded corolla", "reviewer_info": "Posted by Asad on Apr 17, 2011", "familiarity": "", "review_text": "My cousin owned it and i drove it several times, just one line ITS JUST AN UPGRADED COROLLA, and nothing more nothing less. Brand new should not cost more than 30 lac and here Indus is selling it for around 78 lac. A person who buy it at this price, he is the most foolish person on this planet, even if he has easymade black money or has garden of dollar trees at his backyard.", "style": "2 rating", "comfort_rating": "3 rating", "fuel_economy": "2 rating", "perfomance": "1 rating", "value_for_money": "3 rating", "overall_rating": 2, "helpful_votes": "(7 out of 10 people found this review helpful)"}]