[{"make": "Toyota", "model": "Rush", "car_model": "2010 Toyota Rush G Limited", "review_title": "Value to Money Compact SUV", "reviewer_info": "Posted by ahamd hayat on Feb 18, 2022", "familiarity": "Familiarity: I owned this car.", "review_text": "AoA \ntogota Rush is Excellent all rounder compact SUV.. Excellent Ground Clearance. 4x4 is engaged all time its not AWD.. Unique Feature is that it has Central Differential Lock which is not included in any Crossover that have AWD option... As its toyota Its reliable and parts sre easy to traced.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Rush", "car_model": "2018 Toyota Rush S", "review_title": "Toyota Rush S", "reviewer_info": "Posted by Anonymous on Oct 06, 2020", "familiarity": "Familiarity: I owned this car.", "review_text": "Pros:\r\n* Excellent ground clearance of 220 mm and an excellent submersion height of 60 mm make this car ideal for dealing with heavy rains and bad roads.\r\n* Excellent styling - looks like a smaller Fortuner.\r\n* Reasonable good tech - a very good Kenwood audio headset supporting CarPlay and Android Auto, automatic headlights, multiple power ports, great steering controls of audio headset.\r\n* 7 seater.\r\n\r\nCons\r\n* Lack of a 4th gear makes this car a horrible experience on the highway. The engine noise becomes very annoying once you start going above 100 km/hr.\r\n* The price in Pakistan is ridiculously high. Regionally, this car competes with Mitsubishi Expander and Honda BR-V where the price of all three is within a narrow range. In Pakistan, Toyota Rush is priced so extremely high which is, in my personal opinion, the SOLE reason for its failure in this market. Otherwise, it would have easily been far more successful than the BR-V if it had been priced closer to BR-V's price.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "2 rating", "overall_rating": 3, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Rush", "car_model": "2019 Toyota Rush G A/T", "review_title": "Comfort drive", "reviewer_info": "Posted by Kamil Malik on Jul 10, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Good SUV in the range of 5 million. Also it is much better for long journey specially in the northen areas as it has 220 mm of ground clearence and rear wheel drive also. My personal experience with this vehicle is very good. It is wrong to compare Toyota Rush with Honda BRV because BRV is a 7 seater MPV and Rush is 7 seater SUV.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Toyota", "model": "Rush", "car_model": "2019 Toyota Rush G A/T", "review_title": "excillent car", "reviewer_info": "Posted by Vicky Shalapuri on May 21, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "excillent style..  look like fortuner..  bht zabardast car hai..  aur khaas bt 7seater hai. 7seater k hisab se bht achi car hai..  honda brv k muqable mein to 10 20 ka farq hai.. bht hi luxury car hai.  fuel eficient hai..........  .......... ..... my dream car hai..  bs price zyada hai is ki pakistan mein aur countries mein km hai is ki", "style": "5 rating", "comfort_rating": "4 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "3 rating", "overall_rating": 3, "helpful_votes": "(0 out of 1 person found this review helpful)"}, {"make": "Toyota", "model": "Rush", "car_model": "2006 Toyota Rush X", "review_title": "TOYOTA RUSH off Road Performance", "reviewer_info": "Posted by JWDKHAN on Aug 07, 2015", "familiarity": "Familiarity: I owned this car.", "review_text": "The exterior of this midrange SUV is quiet attractive. It looks like an SUV . No idea about the 2Wd model because I own a 4WD model. Its performance on Off roads is exceptional I have tried it no some pretty tough terrains it has never disappointed me, In fact it has surprised me many times. It does not have a low ratio gear as available in most SUVs but still you can manoeuvre it in some pretty tough road conditions. the fuel consumption is on a higher side if you compare it with a car. Its combined average is 8.5 to 11 km/L . Which is far better than any 4WD suvs in its class. \r\n\r\nDraw Backs: parts availability . Parts are difficult to find , but are available if you look hard enough.\r\n \r\nThe 15000 CC with automatic gear is a bit smaller for this vehicle. It should have at least 18000 cc engine.", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "2 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(3 out of 4 people found this review helpful)"}]