[{"make": "Honda", "model": "N One", "car_model": "2015 Honda N One Premium Tourer", "review_title": "Honda N one premium Tourier explained", "reviewer_info": "Posted by Anonymous on Sep 07, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior is Beautiful with all chrome plating in Premium Tourier package and headlights everything is beautiful.\r\n\r\nInterior  is much better than exterior its very comfortable car and you cant feel you are sitting in a small car from the looks and comfort of its experience, it has almost all features that you can find in Honda Fit and expensive cars, The Premium tourier package carries Paddle shifters as well which are highly affective.\r\n\r\nThe pick of this car is really impressive, i drive Grandy and this car is new for me i never felt i am in an under power car.\r\n\r\nThe only negative factor i found is the car milage is not 18-19 KM/L in city as i read on internet before buying, on Long it gives 20 easily but in city i belong from sialkot and it is not giving me above 13-14 KM/L which is not impressive at all. besides fuel issue this car is the best car in 660cc category.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Honda", "model": "N One", "car_model": "2013 Honda N One G", "review_title": "Good for a congested city like Karachi", "reviewer_info": "Posted by Imran on May 21, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Great vehicle, fuel economy is good, seating capacity plenty, can easily take six persons due to connecting front seats, very comfortable, parts are expensive, the sideview mirror alone is around 18k each and not easily available. Used for more than 3 years.", "style": "4 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Honda", "model": "N One", "car_model": "2014 Honda N One Premium Tourer", "review_title": "N one is a decent looking small hatchback that is both economical and practical", "reviewer_info": "Posted by Zulayed Farooqi on May 06, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "EXTERIOR:\r\nThe car looks quite different yet good looking. the front especially with its round headlights. it's size is compact and very easy to manoeuvre on our roads. it's got projector headlights with HIDs. it has 15\" rims.\r\nENGINE: \r\nthe 660cc turbocharged engine makes enough power for you to overtake cars with ease in city traffic. it does 0-100km/h in 13s. fuel eco is around 18km/l in city with A/C.\r\nINTERIOR: \r\nthe interior is well designed and one of the nicest to sit in as compared to other cars of this class although it is not as spacious. the seats are soft and have enough space for 4 adults. ride quality is excellent as drive is quite smooth with minimal outside noise however, the suspension is a bit hard. A/C performance is decent. boot space is limited due to the small size of car. \r\nFEATURES:\r\ncruise control, push start, climate control, auto headlights, radar braking, traction control, 8 airbags, back camera, idle stop, multimedia steering, retractable mirrors etc.", "style": "4 rating", "comfort_rating": "3 rating", "fuel_economy": "4 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Honda", "model": "N One", "car_model": "2016 Honda N One G", "review_title": "Car resemblances", "reviewer_info": "Posted by Cyrus Khan on Apr 13, 2019", "familiarity": "Familiarity: I owned this car.", "review_text": "Exterior looks like Mini Cooper S. See body color combinations and lights, body shape, interior and whatever u see in. Looks like Honda did something nice likely to be. Even Japan had changed many car models on time, now see our automobile industry where models take too much time to change as sometimes kept being obsolete.", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Honda", "model": "N One", "car_model": "2015 Honda N One Tourer", "review_title": "Honda N wgn 2015", "reviewer_info": "Posted by Fahad Anwar on Mar 07, 2017", "familiarity": "Familiarity: I owned this car.", "review_text": "I am writing this Review ONLY for Honda N wgn Model, which was unfortunately not present among the given list.\r\nLet me first  highlight its -ive points clearly, if your are a Driver of  engines above 1.0, 1.3 cc then you will feel hell of discomfort on starting drive on 660cc engine. \r\nSo before going towards choosing this Engine make sure your Family is small and your drive is smooth inside City. When Engine starts it makes noise but sooths after some warm up.\r\nBody is low so Roads here in our country have poor set ups of Speed Breakers &amp; Humps, so you need to be very careful on passing those.\r\nNow lets come to +ive Points, Such a smooth drive, like those of Luxurious cars,  ABS is good, Spacious, Cruise Control, CTBA such a nice feature in this mini car, 6+ Air Bags, Multi Media Steering, Touch LED, Sound system is high, Auto Mirrors, and  Auto Side mirrors,. Mileage is good 15-17 avg inside city area. \r\nSuspension is good. Recommended for Small Family", "style": "3 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Honda", "model": "N One", "car_model": "2013 Honda N One Tourer", "review_title": "Mini Luxury car", "reviewer_info": "Posted by Najeeb Ahmad on Oct 11, 2016", "familiarity": "Familiarity: I owned this car.", "review_text": "Best bugdeted car for family. Interior gives you nice feeling like you cannot feel you sit in small car. Tons of features which is not yet loaded into BIG cars.\r\n\r\nSuspension is good, I fly it over 125 km/h and I didn't feel much pain to control on that speed.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Honda", "model": "N One", "car_model": "2014 Honda N One Tourer", "review_title": "Honda N one tourer", "reviewer_info": "Posted by Waqar Waheed on Jun 18, 2016", "familiarity": "Familiarity: I owned this car.", "review_text": "N one come in 16 different colors to choose from, looks like Mr. Bean car, interior is spacious, for a small car. Extra ordinary features which you don't find in local cars not even in 1500 cc car, it has Turbo with manual paddle shifters for acceleration, equivalent to 1300 cc engine, Traction Control so car don't slip in driving,Cruise Control starts at 30 km upto 110km  Eco Idle. CTBA city traffic braking active system (Radar system), ABS, 6-8 air bags depending upon model, Auto lights with HID projection Lights, retractable side mirrors AC is very chill,, 6 person's capacity(tightly) which comes with a price i.e ride height is too low so you have place so called spacers in rear tiers. Spare parts are expensive so drive carefully\r\nfuel economy is little bit down in Pakistan i.e 13 - 19 km/ltr, (rough 13 soft 19) though honda japan claims it to be 27 km/ltr (front Wheel)", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(5 out of 5 people found this review helpful)"}]