[{"make": "Suzuki", "model": "Ravi", "car_model": "2024 Suzuki Ravi Euro II", "review_title": "No Features and expensive", "reviewer_info": "Posted by Hussain  on Sep 13, 2024", "familiarity": "Familiarity: I owned this car.", "review_text": "1. Outdated Design: The Ravi's design is old and boxy, lacking modern features and aerodynamics.\n\n2. Underpowered Engine: The 796cc engine can feel sluggish, especially when loaded or driving uphill.\n\n3. Poor Fuel Efficiency: The Ravi's fuel economy is not impressive, especially compared to newer models.\n\n4. Basic Interior: The interior is simple and lacks modern amenities, such as infotainment systems or advanced safety features.\n\n5. Limited Safety Features: The Ravi lacks essential safety features like airbags, ABS, and EBD.\n\n6. Rough Ride: The Ravi's suspension can be unforgiving, leading to a bumpy ride on rough roads.\n\n7. Limited Ground Clearance: The Ravi's low ground clearance can make it prone to scraping or damage on rough roads.\n\n8. Old Technology: The Ravi uses outdated technology,  and basic transmission.\n\n9. Maintenance Issues: Some owners have reported issues with maintenance, including parts availability and reliability.", "style": "2 rating", "comfort_rating": "1 rating", "fuel_economy": "2 rating", "perfomance": "3 rating", "value_for_money": "1 rating", "overall_rating": 1, "helpful_votes": "(0 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "Ravi", "car_model": "2018 Suzuki Ravi Euro II", "review_title": "waste of money but sleeping vehicle safety department", "reviewer_info": "Posted by pak used cars on Apr 29, 2024", "familiarity": "Familiarity: I owned this car.", "review_text": "exterior good but interior bakwas like a heater in summer and engine heat generate mentally problems and very sensitive for your health required ac and comfortable seats air bags and petrol engine replace in diesel engine body is very bad material not rust proof and price is very high", "style": "1 rating", "comfort_rating": "1 rating", "fuel_economy": "3 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 2, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Ravi", "car_model": "2022 Suzuki Ravi Euro II", "review_title": "Price Rate of Ravi is too high  beyond the point view of car", "reviewer_info": "Posted by Wahab zada on Dec 25, 2023", "familiarity": "Familiarity: I owned this car.", "review_text": "A very simple car .......................................\nExterior  is not BAD . ................................\nbut quality of interior is satisfied.........\nIt has no saftey features at the price bracket of 18 lacs ....\nso company provide  features in Suzuki Ravi..............\nThanks.........", "style": "2 rating", "comfort_rating": "1 rating", "fuel_economy": "3 rating", "perfomance": "2 rating", "value_for_money": "1 rating", "overall_rating": 1, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Ravi", "car_model": "2016 Suzuki Ravi", "review_title": "Kamran_Miraj_Khan", "reviewer_info": "Posted by Pakwheels User on Nov 17, 2016", "familiarity": "Familiarity:", "review_text": "For me!\r\nthis famous roadrunner is more commonly known as Suzuki Pick Up. This automobile is, primarily, meant for the transportation of goods all over the country. Either you plan the delivery of commodities from one shop to the other or have to go for some other important transportation assignment the highly enhanced Suzuki Ravi 2016 model is best suited for such accomplishments with a lot of convenience and reliability.\r\nWe love them for there effort and hard work for our comfort thanks.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(0 out of 2 people found this review helpful)"}, {"make": "Suzuki", "model": "Ravi", "car_model": "Suzuki Ravi PICKUP STD VX", "review_title": "ALTO VXR 2010 (CNG)", "reviewer_info": "Posted by Lucifer on Sep 30, 2012", "familiarity": "", "review_text": "The car is very good in local but pickup is very bad normally and with A/C road pr laet jaati hai aur A/C bund kro phir sai chalti hai\r\nThe price is very high and car is very  bad but fuel economy is the only thing which is the best otherwise \r\nno power and the main thing is breaks are as bad as they are not present the breaks are veryyyyyyyyyyyyy baaaaaaadddddddddddddd", "style": "3 rating", "comfort_rating": "1 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 3, "helpful_votes": "(1 out of 4 people found this review helpful)"}]