[{"make": "Suzuki", "model": "Kizashi", "car_model": "2018 Suzuki Kizashi Base Grade", "review_title": "Suzuki Kizashi Cars", "reviewer_info": "Posted by bareera on May 21, 2018", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "Suzuki is renowned for its desirable motorcycles, but its cars historically haven't enjoyed nearly the same respect. The Suzuki Kizashi midsize sedan is a serious attempt to bring the company's automotive division up to snuff. Billed as a sophisticated sports sedan at a family-sedan price, the Kizashi generally delivers. It looks sharp, it drives well and its interior is one of the nicest in the segment. While the Kizashi is billed as midsize, its dimensions actually fall in between that segment and increasingly large compacts. This means it's in the unique position to compete against both camps. It's larger, more luxurious and better built than most compacts, yet less expensive and agiler than the midsizers. We think it's definitely worth a look, but the biggest obstacle could be finding one given Suzuki's limited dealer network.", "style": "4 rating", "comfort_rating": "4 rating", "fuel_economy": "4 rating", "perfomance": "4 rating", "value_for_money": "4 rating", "overall_rating": 4, "helpful_votes": "(1 out of 1 person found this review helpful)"}, {"make": "Suzuki", "model": "Kizashi", "car_model": "2015 Suzuki Kizashi Base Grade", "review_title": "Reliable comfortable overall  best in its class", "reviewer_info": "Posted by Pakwheels User on Mar 20, 2018", "familiarity": "Familiarity: I owned this car.", "review_text": "I have recently recently driven this car and it has changed my views of this car....  It has good handling....  Smooth and quick power response...  Its seats are very comfortable with strapped in feel what I believe  it's superior then Honda accord of its era.... Because one of my friends own Honda Accord 2011 local one.... My review is bit harsh but facts are facts drive Kazashi to believe me......  The owner was more then satisfied with his purchase...  He bought new in 2015 just to test this car in real world and it end up to be his daily driven car.....  Overall 10/10 in this price car was driven 89000km", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "3 rating", "perfomance": "4 rating", "value_for_money": "5 rating", "overall_rating": 4, "helpful_votes": "(0 out of 0 people found this review helpful)"}, {"make": "Suzuki", "model": "Kizashi", "car_model": "2011 Suzuki Kizashi Base Grade", "review_title": "Kizashi vs Camry and Accord and our local assembled cars", "reviewer_info": "Posted by Ali Khan on Mar 13, 2015", "familiarity": "Familiarity: I did not own this car, but have driven this car.", "review_text": "Overall exterior of Kizashi is just fair,,, but the interior is too awkward, to compare kizashi with accord or camry, it is very economical and at reasonable price,,,, but to compare it with Kizashi abroad, local assembled is very disappointing.\r\nThe burning question of today is that why we Pakistani under estimating our own country fellows? why we are not providing them services provided in the same cars abroad? a 2000 model imported corolla is much better than 2015 local made corolla, a 1990 Japanese Alto is much better than 2015 local made,,,, Honda is little bit better than others but a 2005 imported civic is much comfortable, economical and reasonable than 2015 Pakistani..  \r\nThe government have no such a filtering department that regulate the local companies and provide them a quality standard, they have no such policy for the local companies to regulate them in a proper way...\r\neven some cars have not a fair braking system,, the government must recheck their policies.", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "2 rating", "perfomance": "3 rating", "value_for_money": "2 rating", "overall_rating": 2, "helpful_votes": "(4 out of 8 people found this review helpful)"}, {"make": "Suzuki", "model": "Kizashi", "car_model": "2015 Suzuki Kizashi", "review_title": "A Suzuki for 50 lacs", "reviewer_info": "Posted by Malik bassal on Feb 16, 2015", "familiarity": "", "review_text": "i have seen the interior and exterior. The point here is that all the cars not just camey or accord but in this range of price are giving features which kizashi is offering. Secondly when you spend 50 lacs on a car it is just not for a cruise control or an auto air-con, you pay 50 lac to so that a car makes a statement for you when you arrive in it, and the way i see it, its a dull car , boring front with plasticy honey comb grill and nothing impressive at the back except tail lights which are acceptable, and then comes in a biiger issue, suppose you arrive on a party in your big (well for pakistan) kizashi where your friends are waiting and start chatting up on cars so what is the one arrived on accordy , the other side in a camry and when you are asked about your arrival, just imagine saying i arrived in my KIZASHI. I think the name would be more embarassing then the car, i think Pak suzuki should have chosen another name.", "style": "1 rating", "comfort_rating": "2 rating", "fuel_economy": "1 rating", "perfomance": "1 rating", "value_for_money": "3 rating", "overall_rating": 1, "helpful_votes": "(1 out of 5 people found this review helpful)"}, {"make": "Suzuki", "model": "Kizashi", "car_model": "2015 Suzuki Kizashi", "review_title": "Best Vehicle at best price", "reviewer_info": "Posted by Najeeb Ullah Khan Nangialy on Feb 15, 2015", "familiarity": "Familiarity: I owned this car.", "review_text": "Honda Accord and Toyota Camry which is same in level and feature to Suzuki Kizashi but Kizashi is less than half of it price. So i will suggest all the customers who are looking to some 2400 CC luxury sport sedan should but it instead of wasting double money on other cars of same features", "style": "5 rating", "comfort_rating": "5 rating", "fuel_economy": "5 rating", "perfomance": "5 rating", "value_for_money": "5 rating", "overall_rating": 5, "helpful_votes": "(2 out of 3 people found this review helpful)"}, {"make": "Suzuki", "model": "Kizashi", "car_model": "2015 Suzuki Kizashi Base Grade", "review_title": "Good Car", "reviewer_info": "Posted by Ahmed Amber on Feb 15, 2015", "familiarity": "Familiarity: I have neither owned nor driven this car.", "review_text": "Good ext. inerter. is look good but need to change in beach color. front gril have to also change the style. al the end ppl dont compare please with local paksuzuki crap... unless you don't buy it ..suzuki japan model is much better you can see the quality in used japanese car so its good against accord or camry ...", "style": "3 rating", "comfort_rating": "4 rating", "fuel_economy": "2 rating", "perfomance": "3 rating", "value_for_money": "4 rating", "overall_rating": 3, "helpful_votes": "(3 out of 5 people found this review helpful)"}]